{
    "version": "https://jsonfeed.org/version/1",
    "title": "Didier Lopes Blog",
    "home_page_url": "https://didierlopes.com/blog",
    "description": "Didier Lopes Blog",
    "items": [
        {
            "id": "https://didierlopes.com/blog/ai-chatbots-wont-revolutionize-finance-but-intelligent-workspaces-will",
            "content_html": "<p align=\"center\"><img width=\"600\" src=\"https://didierlopes.com/blog/2024-12-27-why-chatgpt-alone-wont-revolutionize-finance.png\"></p>\n<p>Why the future of financial analysis isn't about chatbots, but about intelligent workspaces that combine your data, tools, and AI exactly when you need them.</p>\n<div style=\"border-top:1px solid #0088CC;margin:1.5em 0\"></div>\n<p>When ChatGPT launched, everyone rushed to build financial chatbots. But they missed two fundamental truths:</p>\n<ul>\n<li>The best AI model is useless without access to your data.</li>\n<li>Access to data isn't enough - AI needs to handle complete workflows, not just conversations.</li>\n</ul>\n<p>The problem with financial chatbots:</p>\n<ol>\n<li>They can't access your proprietary data</li>\n<li>They can't handle complex financial workflows</li>\n<li>They force analysts to work in an unnatural chat interface</li>\n</ol>\n<br>\n<p>Here's how OpenBB solves this:</p>\n<p>First, we ensure complete data access:</p>\n<ul>\n<li>Run everything on-premise or in your VPC</li>\n<li>Connect any data source: files, APIs, third-party feeds, anything</li>\n<li>Use a universal data layer that standardizes everything (whether it's CSV, Excel, Snowflake, or APIs)</li>\n</ul>\n<p>But the real innovation?</p>\n<p>We're building AI differently.</p>\n<p>Instead of forcing analysts to chat with a bot, we're embedding intelligence directly into their workspace.</p>\n<p>Think dashboards with widgets, not chat windows. Data visualization, not text conversations.</p>\n<p>This is exactly what Kimberly Tan (partner @ a16z) predicted in <a href=\"https://a16z.com/big-ideas-in-tech-2025/\">her analysis</a>:</p>\n<blockquote>\n<p><em>\"Chat was the first experimental interface — now I expect there will be new, novel interaction mechanisms. In this phase, AI agents will be able to take direct action in the workflow, and the UI will be reimagined for humans to review work or do QA.\"</em></p>\n</blockquote>\n<br>\n<p>The result?</p>\n<p align=\"center\"><img width=\"1200\" src=\"https://didierlopes.com/blog/2024-12-27-why-chatgpt-alone-wont-revolutionize-finance.png\"></p>\n<p>A workspace where:</p>\n<ul>\n<li>AI appears only when needed (for insights, summaries, or generating visualizations)</li>\n<li>Firms can adopt AI at their own pace</li>\n<li>Analysts keep their familiar workflows while gaining AI superpowers</li>\n</ul>\n<p>Let me show you this in action.</p>\n<p>Last week, I shared how <a href=\"https://x.com/mattmaximo1/status/1869413550210625818\">Matt from VanEck</a> built a powerful dashboard integrating multiple distinct data sources on OpenBB. Post with comments can be found <a href=\"https://www.linkedin.com/posts/didier-lopes_today-i-saw-a-glimpse-of-the-future-matt-activity-7275174801860636672-qoy4?utm_source=share&amp;utm_medium=member_desktop\">here</a>.</p>\n<p>I only showed a screenshot of this dashboard with data.</p>\n<p>There was no sign of AI in it.</p>\n<p>However, if I had simply pressed shortcut \"Ctrl+L\", the copilot window would have opened and I would have been able to natively interact with the data - and generate new data from it.</p>\n<p align=\"center\"><img width=\"1200\" src=\"https://didierlopes.com/blog/2024-12-27-why-chatgpt-alone-wont-revolutionize-finance_1.png\"></p>\n<p>This demonstrates that the future of financial AI isn't about chatbots - it's about intelligent workspaces.</p>\n<p>As <a href=\"https://x.com/pyquantnews\">Jason from PyQuantNews</a> astutely observes: <em>\"OpenBB solves the data aggregation and centralization challenge without relying on AI, creating a ton of value from it. And then, you allow users to utilize AI in their workflows as they see fit.\"</em></p>\n<p>This isn't just another AI product.</p>\n<p>It's the future of financial analysis - where AI enhances your workspace instead of replacing it.</p>",
            "url": "https://didierlopes.com/blog/ai-chatbots-wont-revolutionize-finance-but-intelligent-workspaces-will",
            "title": "AI Chatbots Won't Revolutionize Finance, But Intelligent Workspaces Will",
            "summary": "Beyond the AI hype - why the future of financial analysis isn't about chatbots, but about intelligent workspaces that combine your data, tools, and AI exactly when you need them.",
            "date_modified": "2024-12-27T00:00:00.000Z",
            "tags": [
                "openbb",
                "artificial intelligence",
                "chatgpt",
                "financial analytics",
                "future of finance"
            ]
        },
        {
            "id": "https://didierlopes.com/blog/openbb-and-our-global-reach-since-leaving-beta",
            "content_html": "<p align=\"center\"><img width=\"600\" src=\"https://didierlopes.com/blog/2024-12-22-openbb-and-our-global-reach-since-leaving-beta.jpeg\"></p>\n<p>This is how OpenBB is reaching users worldwide with Chrome's translation features, making financial analytics accessible in multiple languages and expanding our presence across 84% of countries since launch.</p>\n<div style=\"border-top:1px solid #0088CC;margin:1.5em 0\"></div>\n<p>Since our launch on October 7th, we realized that while the majority of our audience is based in the US - we have users utilizing OpenBB from all around the globe.</p>\n<p>In fact, if we count sign ups since October we have a 84% country representation.</p>\n<p>Today, most of the top financial firms have reached out to OpenBB to learn more. Either because they heard about us from others, or had someone internally speaking about OpenBB.</p>\n<p>However - it has also happened having conversation with firms that focus so much on emerging markets (e.g. LatAm) that they speak mostly Portuguese or Spanish.</p>\n<p>So, here I am showing you that you can utilize the Google Translate feature that comes with Google Chrome in under 10 seconds to have our product being translated in real-time to your language of choice.</p>\n<p align=\"center\"><img width=\"600\" src=\"https://didierlopes.com/blog/2024-12-22-openbb-and-our-global-reach-since-leaving-beta_1.jpeg\"></p>\n<p align=\"center\"><img width=\"600\" src=\"https://didierlopes.com/blog/2024-12-22-openbb-and-our-global-reach-since-leaving-beta_2.jpeg\"></p>\n<p>I've been playing with it in Portuguese, and it works <em>surprisingly</em> well.</p>\n<p>This even means that you can utilize your AI copilot in your language of choice, which is mind blowing!</p>\n<p>It's this Christmas that I will be able to convert my family to DAU. 😃</p>",
            "url": "https://didierlopes.com/blog/openbb-and-our-global-reach-since-leaving-beta",
            "title": "OpenBB and our global reach since leaving beta",
            "summary": "This is how OpenBB is reaching users worldwide with Chrome's translation features, making financial analytics accessible in multiple languages and expanding our presence across 84% of countries since launch.",
            "date_modified": "2024-12-22T00:00:00.000Z",
            "tags": [
                "openbb",
                "global audience",
                "reach",
                "internationalization",
                "languages",
                "pwa"
            ]
        },
        {
            "id": "https://didierlopes.com/blog/why-ai-analysts-need-human-like-workspaces-not-just-chat-interfaces",
            "content_html": "<p align=\"center\"><img width=\"600\" src=\"https://didierlopes.com/blog/2024-12-20-why-ai-analysts-need-human-like-workspaces-not-just-chat-interfaces.jpeg\"></p>\n<p>Why I believe AI agents need the same comprehensive workspace tools as human analysts, moving beyond simple chat interfaces to enable true financial research and analytics.</p>\n<div style=\"border-top:1px solid #0088CC;margin:1.5em 0\"></div>\n<p>This week, Insight Partners published <a href=\"https://www.insightpartners.com/ideas/state-of-the-ai-agent-ecosystem-use-cases-and-learnings-for-technology-builders-and-buyers/\">\"The state of the AI Agents ecosystem: The tech, use cases, and economics\"</a> which mentions OpenBB on the map in terms of Financial Services AI agents.</p>\n<p>I'd like to explain our flavor of AI analyst.</p>\n<p>An AI agent is defined as \"a program that can interact with its environment, collect data, and use the data to perform self-determined tasks to meet predetermined goals\".</p>\n<p>If I were to describe the role of an Analyst I could use that exact same sentence, except that I wouldn't use \"program\" but \"human\".</p>\n<p>Yet most companies and products out there are focusing on the data and forgetting about the interface.</p>\n<p>If the job to be done by an AI agent is the same as the human agent - why aren't we starting from the assumption that they need the same tools and interface as a human analyst would.</p>\n<p>I mean, I don't see financial analysts spending their day doing analysis &amp; research on Slack or on a chat-only interface.</p>\n<p>This is where we differ and where we decided to take the longer path in doing what's right.</p>\n<p>No shortcuts.</p>\n<p>Yes, our AI agent (or the one our users bring) has access to their own data.</p>\n<p>But more importantly, it is interconnected with a workspace, effectively having the same type of capabilities that an analyst would so it can truly perform research and analytics.</p>\n<p>The goal is actually straightforward:</p>\n<p>The AI agent should be able to do anything and everything that a user can with a mouse and keyboard.</p>\n<p>That includes:</p>\n<ul>\n<li>Extracting insights from multiple datasets</li>\n<li>Adding a particular widget to a dashboard</li>\n<li>Creating a dashboard from scratch based on data available</li>\n<li>Run a particular prediction model with pre-define parameters</li>\n<li>Collaborating on a dashboard with a colleague</li>\n<li>Having access to the internet to add research notes to the dashboard</li>\n<li>Join datasets efficiently</li>\n<li>Write SQL queries to extract particular data from a data warehouse</li>\n<li>etc...</li>\n</ul>\n<p>Agree or disagree?</p>",
            "url": "https://didierlopes.com/blog/why-ai-analysts-need-human-like-workspaces-not-just-chat-interfaces",
            "title": "Why AI Analysts Need Human-Like Workspaces, Not Just Chat Interfaces",
            "summary": "Why I believe AI agents need the same comprehensive workspace tools as human analysts, moving beyond simple chat interfaces to enable true financial research and analytics.",
            "date_modified": "2024-12-20T00:00:00.000Z",
            "tags": [
                "openbb",
                "ai",
                "analyst",
                "agent",
                "workspace",
                "vision"
            ]
        },
        {
            "id": "https://didierlopes.com/blog/today-i-saw-a-glimpse-of-the-future",
            "content_html": "<p align=\"center\"><img width=\"600\" src=\"https://didierlopes.com/blog/2024-12-18-today-i-saw-a-glimpse-of-the-future.jpeg\"></p>\n<p>My friend Matt, from VanEck, built a backend with data from Coingecko, Velodata, Artemis, CCdata, Glassnode, MSTR Tracker, Telegram and Google - all in OpenBB.</p>\n<div style=\"border-top:1px solid #0088CC;margin:1.5em 0\"></div>\n<p><a href=\"https://x.com/mattmaximo1\">Matt Maximo</a> has been building a backend with data from Coingecko, Velodata, Artemis, CCdata, Glassnode, MSTR Tracker, Telegram and Google.</p>\n<p>However, he didn't find the best product where he could:</p>\n<ol>\n<li>Bring all this data into one interface</li>\n<li>Leverage an intelligence layer on top</li>\n<li>Collaborate with his team on it</li>\n</ol>\n<br>\n<p>Until he did.</p>\n<p>With our free tier - Matt was able to single-handedly create almost 50 different data widgets that he (and his team) will be able to access seamlessly on OpenBB.</p>\n<p>As we shift to firms being more in control of their data, and with the clear gains from having an additional intelligence layer on top of that data - the need for OpenBB in the market has never been clearer.</p>\n<p>Shifting the control back to financial firms.</p>\n<p>More open. More adaptable.</p>\n<p>If you want help on connecting your own backend (crypto or other) to OpenBB - reach out to myself and team.</p>",
            "url": "https://didierlopes.com/blog/today-i-saw-a-glimpse-of-the-future",
            "title": "Today I saw a glimpse of the future",
            "summary": "My friend Matt, from VanEck, built a backend with data from Coingecko, Velodata, Artemis, CCdata, Glassnode, MSTR Tracker, Telegram and Google - all in OpenBB.",
            "date_modified": "2024-12-18T00:00:00.000Z",
            "tags": [
                "openbb",
                "ai",
                "interface",
                "crypto",
                "open source",
                "customization"
            ]
        },
        {
            "id": "https://didierlopes.com/blog/why-we-got-rid-of-pips-at-openbb",
            "content_html": "<p align=\"center\"><img width=\"600\" src=\"https://didierlopes.com/blog/2024-11-09-why-we-got-rid-of-pips-at-openbb.png\"></p>\n<p>At OpenBB, we removed Performance Improvement Plans (PIPs) in an attempt to increase the company's talent density pool rate.</p>\n<div style=\"border-top:1px solid #0088CC;margin:1.5em 0\"></div>\n<h2 id=\"how-did-we-get-here\">How did we get here?</h2>\n<p>We are currently 16 FTE and since the company started 3 years ago, we’ve let go 15 people.</p>\n<p>This means we’re letting go of more than 1 person a quarter since the start of OpenBB.</p>\n<p>Most people had a 3-week PIP process before their departures. But out of the 15 PIPs done, only one was successful. All the others have resulted in a contract termination.</p>\n<p>That’s a success rate of less than 7%, which is extremely low.</p>\n<h3 id=\"statistics\">Statistics</h3>\n<p>If we go into the machine learning domain and have a model that predicts that a team member who gets into a PIP is let go every time - this is the classification matrix that we would have.</p>\n<p align=\"center\"><img width=\"900\" src=\"https://didierlopes.com/blog/2024-11-09-why-we-got-rid-of-pips-at-openbb_02.png\"></p>\n<p>Which has:</p>\n<ul>\n<li>\n<p>93.3% precision - answers: of all the people predicted to be let go (15), how many were let go? (14)</p>\n</li>\n<li>\n<p>100% recall - answers: of all the people that were let go (14), how many were predicted correctly (14)</p>\n</li>\n</ul>\n<p>Now, this isn’t the full story.</p>\n<p>This is the equivalent of a physics book treating an object as a point mass, considering the body as perfectly rigid or assuming the system is isolated with no external forces.</p>\n<p>So what are the other things to consider? Let’s separate these time-wise:</p>\n<ol>\n<li>\n<p>Before a PIP happens</p>\n</li>\n<li>\n<p>During the PIP</p>\n</li>\n<li>\n<p>After the PIP</p>\n</li>\n</ol>\n<h2 id=\"before-a-pip\">Before a PIP</h2>\n<p>Before someone starts a PIP, their performance has already been subpar.</p>\n<p>By definition, performance is a lagging indicator, which means you are already late when you catch this person not pulling as much value as others.</p>\n<p>Particularly when you consider that the person who would be initiating the PIP is the team lead (TL)/manager and isn’t working as closely with this person as others on a daily basis. Hence, coworkers are likely to see firsthand this suboptimal performance in advance of the team lead or manager.</p>\n<p>So, the suboptimal performance from this person over a few days or weeks is likely to go unnoticed and slow down the company.</p>\n<p>In addition, individual contributors (ICs) who work closely with this person are likely to notice this before the TL/manager, thus impacting their motivation.</p>\n<p><em><strong>\"If this person can get the same compensation as I do for average work, why am I putting in so much time and effort?\"</strong></em></p>\n<p>Honestly, if there’s one thing that I’ve learned, it’s that A players get motivated by other A players (“A players attract A players”).</p>\n<h2 id=\"during-a-pip\">During a PIP</h2>\n<p>A PIP takes time. <strong>A LOT of it.</strong></p>\n<p>And that’s the one thing that startups don’t have.</p>\n<p>Imagine that you have the following org:</p>\n<p align=\"center\"><img width=\"900\" src=\"https://didierlopes.com/blog/2024-11-09-why-we-got-rid-of-pips-at-openbb_03.png\"></p>\n<p>If an IC is underperforming, the TL will discuss it with the IC in advance.</p>\n<p>Then the team lead may ask for feedback from other ICs who work with the IC in question.</p>\n<p>After that, the TL will talk with the Director about this before initiating the PIP.</p>\n<p>Then the Director will mention this to the CEO of the company.</p>\n<p>The CEO will likely want to talk with the team lead about this, given that in an organization of 15 people, each team member accounts for more than 5% of the org.</p>\n<p>Now, you may be thinking, “But this happens before the PIP”.</p>\n<p>This happens before and continues throughout the entire PIP. But, during the PIP, it’s even worse because there are regular meetings for a shorter feedback loop, and there needs to be documentation on the progress.</p>\n<p>So yes, this not only takes a lot of time, but it’s also a distraction to the team.</p>\n<p>And that’s the other thing that companies need: “focus”.</p>\n<p>You can’t fully focus at 100% when you know that someone is “fighting” for their job. And not being able to focus impacts each individual’s performance.</p>\n<p>So this inefficiency ends up spreading across the team.</p>\n<h2 id=\"after-the-pip\">After the PIP</h2>\n<h3 id=\"needs-to-be-let-go\">Needs to be let go</h3>\n<p>Ok, someone was underperforming and needs to be let go.</p>\n<p>The company needs to figure out:</p>\n<ul>\n<li>\n<p>How many options this person has vested and handle the paperwork if they want to buy them</p>\n</li>\n<li>\n<p>Whether they have company equipment that needs to be returned</p>\n</li>\n<li>\n<p>What the severance package will be</p>\n</li>\n<li>\n<p>How to handle the news and how the team will react</p>\n</li>\n</ul>\n<p>Again, this will be a distraction for at least an additional week and will affect other team members, who may be surprised by this.</p>\n<p>Particularly because, most of the time, they aren’t aware that the PIP is happening and from their perspective, someone they liked to work with was let go.</p>\n<h3 id=\"has-a-successful-pip\">Has a successful PIP</h3>\n<p>Let’s be honest, these cases are very rare.</p>\n<p>Not just at OpenBB. I’ve spoken with other founders, and this is the same feedback I’ve received.</p>\n<p>But let’s ignore that, we already mentioned it at the start.</p>\n<p>Someone on a PIP—almost by definition—isn’t a high performer. They could be a high performer in some parts of the job, but not as a whole. However, this is the exception, not the rule.</p>\n<p>The rule, often, is that this person has been doing just enough to be competent at the company—but not excel. Then, over a period of time, due to internal reasons, lack of motivation, etc., they fall below that threshold.</p>\n<p>This means that even after a successful PIP, you are putting all of these resources toward getting—not a high performer, but a B+ player.</p>\n<p>And ultimately, this is why we are getting rid of the PIP at OpenBB.</p>\n<p>Being <strong>“good enough”</strong> isn’t the culture we want for OpenBB and doesn’t represent our team today. If you let the bar slip, you won’t even realize it until it’s too late.</p>\n<p>Again, performance is a lagging indicator and can have both positive and negative effects on the team—so it’s important to protect the team from poor performers.</p>\n<p>There are two exceptions to this:</p>\n<p><strong>1. Imagine that this person can turn their output into 4x, imagine they had a wake-up call.</strong></p>\n<p>Several questions need to be asked:</p>\n<ul>\n<li>\n<p>If this person can perform at this level, why weren't they doing it before?</p>\n</li>\n<li>\n<p>How long will they maintain this level of performance?</p>\n</li>\n<li>\n<p>Will we need to have another serious conversation to get this person to reach this level of competency again at a later stage?</p>\n</li>\n<li>\n<p>Will they always resent the company because of the PIP?</p>\n</li>\n</ul>\n<p>It all boils down to this: if this person isn’t motivated by what we’re building, regardless of their skill set, they weren’t a good fit in the first place.</p>\n<p>We’re fortunate to have a pipeline of people applying for positions at OpenBB, not just for the money but for the product and the mission of the company.</p>\n<p><strong>2. The person is a high performer but has been performing poorly in some areas of the job (e.g. communications, testing, documentation, …)</strong></p>\n<p>This person had likely received feedback multiple times, but the PIP made it more real: <em>“This is what we are looking for in a person for your role; you have 2-3 weeks to prove that you can double down on your weaknesses and reach the level the team needs you to be at.”</em></p>\n<p>This is what happened to us, and the person improved significantly, so much so that they are now a core part of who OpenBB is today.</p>\n<p>This success story was one of the main reasons we continued doing PIPs.</p>\n<p>But the likelihood of it happening again is so low that it’s not worth keeping PIP to look for another success story like this one.</p>\n<h2 id=\"so-whats-next\">So what’s next?</h2>\n<h3 id=\"how-we-think-about-talent-level-at-openbb\">How we think about talent level at OpenBB</h3>\n<p>Let’s say you define company’s talent value as the sum of the talent of each individual divided by the total number of team members.</p>\n<p>There are two ways to increase this value:</p>\n<ul>\n<li>\n<p>Hire people who are above OpenBB’s talent level</p>\n</li>\n<li>\n<p>Let go of people who fall below the talent level</p>\n</li>\n</ul>\n<p>Or, ideally, do both.</p>\n<p>The problem is that for the first option, you often need <strong>a LOT</strong> of capital.</p>\n<p>For the second, you don’t. Not only that but letting go of low performers will accomplish two things simultaneously:</p>\n<ul>\n<li>\n<p>Increase OpenBB’s talent level immediately.</p>\n</li>\n<li>\n<p>Free up resources that can be invested in someone above OpenBB’s current talent value (assuming that companies should always seek high performers and avoid settling for underperformers).</p>\n</li>\n</ul>\n<p>And that’s why removing PIPs leads to an increase in the company’s talent level. You’re not just increasing the talent level once, but likely twice.</p>\n<p>Here’s an example:</p>\n<p>Imagine we have 5 people at OpenBB with talent scores of 2, 7, 7, 7, and 9. Then OpenBB’s talent level is:</p>\n<p>(2+7+7+7+9)/5 = 6.4</p>\n<p>If we let go of the employee with a talent score of 2, our talent level becomes 7.4. Then, if we bring in someone with a score of 8 using the same resources, that talent level increases to 7.6.</p>\n<p>You get the idea.</p>\n<h3 id=\"what-the-team-can-expect\">What the team can expect?</h3>\n<p>Full transparency.</p>\n<p>We want to build a culture where feedback is an ever-present element, and we don’t need to wait for performance reviews to give feedback that can substantially improve team performance and push the company forward.</p>\n<p>In fact, not sharing this feedback puts the company in a worse position, and it is your duty to share it. But do so with candor, in a constructive manner that keeps the team member motivated.</p>\n<p>However, each team member must care. This means you can’t rely solely on your team lead to give you feedback every day—you need to ask for it regularly. That’s the best way for you to grow.</p>\n<h2 id=\"final-notes\">Final notes</h2>\n<p>We made this decision after reading <em>No Rules Rules: Netflix and the Culture of Reinvention</em>, where they also removed PIPs.</p>\n<p>Unlike Netflix, we don’t have the resources to:</p>\n<ul>\n<li>\n<p>Pay top of the market</p>\n</li>\n<li>\n<p>Offer a generous severance</p>\n</li>\n</ul>\n<p>We still pay good salaries, just not enough to compete with public companies. This means we need to spend much more time finding diamonds in the rough.</p>\n<p>And that’s why we have a higher turnover; finding diamonds in the rough is much riskier.</p>\n<p>In any case, I think optimizing to pay top of the market is misguided—at least for startups—as it incentivizes the wrong type of talent.</p>\n<p>It incentivizes mercenaries instead of missionaries.</p>\n<p>At an early stage, you need people who want a lot of ownership and autonomy, who are excited to work with a team and on a product they believe in, and who have a chip on their shoulders.</p>\n<p>Regardless of the startup, I have yet to see someone with this mentality who doesn’t end up being successful.</p>\n<p><strong>Note</strong>: Most of the people who were let go would be considered good employees in most companies today, and they had strong referrals. But companies have different types of needs that evolve over time, and as founders, it’s our role to look at the company as a whole and understand what it needs at the moment and, more importantly, what it will need in the coming months and years.</p>",
            "url": "https://didierlopes.com/blog/why-we-got-rid-of-pips-at-openbb",
            "title": "Why we got rid of PIPs at OpenBB",
            "summary": "My thoughts on how removing PIPs can increase the company talent level",
            "date_modified": "2024-11-09T00:00:00.000Z",
            "tags": [
                "openbb",
                "management",
                "leadership",
                "talent",
                "hiring",
                "performance",
                "company-culture",
                "startups"
            ]
        },
        {
            "id": "https://didierlopes.com/blog/implement-feedback-loops-everywhere-you-can",
            "content_html": "<p align=\"center\"><img width=\"600\" src=\"https://didierlopes.com/blog/2024-10-25-implement-feedback-loops-everywhere-you-can.jpeg\"></p>\n<p>Maximizing team transparency through focused feedback sessions.</p>\n<div style=\"border-top:1px solid #0088CC;margin:1.5em 0\"></div>\n<p>A couple of months ago, my co-founder came to NYC for our board meeting.</p>\n<p>During that week, we took a day to sync up with everyone on the team—literally. We had 14 conversations, each lasting up to 30 minutes. Apart from lunch, we did all these back-to-back.</p>\n<p>The goal of this exercise was 2-fold:</p>\n<ul>\n<li>\n<p>Check up on the team. Basically, a more in-depth version of:\n<a href=\"https://openbb.co/company/open/team\">https://openbb.co/company/open/team</a></p>\n</li>\n<li>\n<p>Have the team share anything they want with leadership or ask any questions openly.</p>\n</li>\n</ul>\n<p align=\"center\"><img width=\"900\" src=\"https://didierlopes.com/blog/2024-10-25-implement-feedback-loops-everywhere-you-can_2.jpeg\"></p>\n<h2 id=\"structure\">Structure</h2>\n<h3 id=\"part-1---20-minutes\">Part 1 - 20 minutes</h3>\n<p>For the first 20 minutes, we asked the following questions to each team member:</p>\n<ol>\n<li>\n<p>How do you feel working for OpenBB today?</p>\n</li>\n<li>\n<p>What do you enjoy the most about working at this company?</p>\n</li>\n<li>\n<p>Who do you get along the best? and why?</p>\n</li>\n<li>\n<p>Who do you feel like you have a not-so-close relationship with? and why?</p>\n</li>\n<li>\n<p>What does your day-to-day look like?</p>\n</li>\n<li>\n<p>How would you describe the relationship with your manager/team lead?</p>\n</li>\n<li>\n<p>It's 2028 and OpenBB didn't make it. What are potential reasons that you would bet on that lead to this?</p>\n</li>\n<li>\n<p>If you had to tell us what your biggest achievement is since being in the company, which one would you pick?</p>\n</li>\n<li>\n<p>What was your lowest moment during company time - and why? What could we have done better?</p>\n</li>\n<li>\n<p>(for managers/team leads) How do you feel about the team you have today?</p>\n</li>\n</ol>\n<h3 id=\"part-2---10-minutes\">Part 2 - 10 minutes</h3>\n<p>During the last 10 minutes, the team could ask us about anything.</p>\n<p>Funnily enough, we learned just as much (if not more) from the questions the team asked than the ones from Part 1.</p>\n<h2 id=\"results\">Results</h2>\n<p>Lack of focus is the biggest risk/challenge that we face as a company.</p>\n<h3 id=\"culture\">Culture</h3>\n<ul>\n<li>\n<p>Handbook is important (folks didn't know about personal development budget, PIP, etc…)</p>\n</li>\n<li>\n<p>The team's main reasons for being happy at OpenBB are autonomy, ownership, smart team, transparency and freedom - very aligned with our values.</p>\n</li>\n<li>\n<p>Remote work is a benefit that more people should take advantage of. Celebrate it even more.</p>\n</li>\n<li>\n<p>It's vital to set boundaries when overworking and know when to decompress to avoid burnout</p>\n</li>\n</ul>\n<h3 id=\"management\">Management</h3>\n<ul>\n<li>\n<p>It's key to consider that each person has different preferences in terms of management style - execution vs contributing to discussion.</p>\n</li>\n<li>\n<p>1:1s are essential and everyone should have them set.</p>\n</li>\n<li>\n<p>1:1s should be focused on the direct report and not necessarily on tasks at hand. Several people highlighted that they felt that their manager cared about them based on conversations about their personal life and personal development.</p>\n</li>\n<li>\n<p>Feedback should go both ways, the manager/leader appreciates when feedback is provided.</p>\n</li>\n<li>\n<p>Setting up expectations clearly for each individual is critical. People appreciate when they know exactly what is expected of them, so they understand how their value is perceived from the company's perspective.</p>\n</li>\n</ul>\n<h3 id=\"rituals\">Rituals</h3>\n<ul>\n<li>\n<p>Monthly update emails are very good. Sometimes even more details would be better.</p>\n</li>\n<li>\n<p>Some people are so focused on execution that they try to protect their time at all costs. It's important to respect this decision and default to async text-based conversations instead of setting up a meeting</p>\n</li>\n<li>\n<p>Dogfood the product from people from different backgrounds is important as it gives different points of view that we can leverage to make our product better</p>\n</li>\n</ul>\n<h3 id=\"communicatiions\">Communicatiions</h3>\n<ul>\n<li>\n<p>Be aware of different comms styles throughout org. In general, people have shared that they appreciate when others send them a DM with feedback based on a conversation in a public channel.</p>\n</li>\n<li>\n<p>Sometimes team members need to put themselves in the shoes of other people first instead of defaulting to defence.</p>\n</li>\n<li>\n<p>We shouldn't compromise on quality. We should aim to agree first on the best solution and then adapt if there's a lack of resources, but knowing what the best solution is and what is the trade-off that is being made</p>\n</li>\n<li>\n<p>When a conversation is taking a few messages back and forth, sometimes a quick huddle should be done</p>\n</li>\n<li>\n<p>Making sure that all stakeholders are involved regarding features or changes in the product before any green light is given to execute. It happened that a green light was given, mockups were created based on that context and the engineering team added the feature. Only for that to get pushed back because a stakeholder that wasn't involved in the discussion saw the final result on Slack chat.</p>\n</li>\n</ul>\n<h3 id=\"transparency\">Transparency</h3>\n<ul>\n<li>\n<p>More transparency when deals are closed - e.g. what are they interested in, how many seats, what do they do on a day-to-day basis</p>\n</li>\n<li>\n<p>When mentioning increased transparency, the vast majority of people think that our level of transparency is very high.</p>\n</li>\n<li>\n<p>A common answer: \"If I have any questions I know can just DM you and you will answer\"</p>\n</li>\n<li>\n<p>Add a Q&amp;A at the end of the status update where everyone can put questions to be answered</p>\n</li>\n<li>\n<p>A common answer: \"I don't like when someone leaves out of a sudden\". Unfortunately, we can't do anything here. We've also asked for feedback on what we could do better, but people understood that there's not much we can do. This is a conversation between the person and the manager and it's unfair for the person being let go if we share their personal information. There's a PIP and that means that before everyone leaves the company they are in 3-4 weeks PIP, where expectations are set clearly and their continuity depends on their output.</p>\n</li>\n<li>\n<p>People appreciate feedback a lot, regardless of if it's positive or not. It's the best way for them to improve.</p>\n</li>\n</ul>\n<h3 id=\"thoughts\">Thoughts</h3>\n<p>I think, at an early stage, everyone should do this. And maybe even at a later stage but in each subset of the org.</p>\n<p>One of the reasons I think this worked so well is that for the first 20 minutes, you are asking the exact same questions to everyone and so that allows you to get answers that you can compare across the board.</p>\n<p>Then, once those 20 minutes are over, the team member feels that they have already been so transparent that they openly ask questions that they are curious about.</p>\n<p>The final result was a presentation with all the combined learnings and actionable.</p>\n<p><strong>What do you think?</strong></p>",
            "url": "https://didierlopes.com/blog/implement-feedback-loops-everywhere-you-can",
            "title": "Implement feedback loops EVERYWHERE you can",
            "summary": "Maximizing team transparency through focused feedback sessions.",
            "date_modified": "2024-10-25T00:00:00.000Z",
            "tags": [
                "openbb",
                "management",
                "leadership",
                "feedback",
                "transparency",
                "culture",
                "remote-work"
            ]
        },
        {
            "id": "https://didierlopes.com/blog/openbb-mobile-app-coming-soon",
            "content_html": "<p align=\"center\"><img width=\"600\" src=\"https://didierlopes.com/blog/2024-10-05-openbb-mobile-app-coming-soon.png\"></p>\n<p>How we built a mobile app, in 1 evening, with 1 engineer.</p>\n<div style=\"border-top:1px solid #0088CC;margin:1.5em 0\"></div>\n<p>Let’s start with a bit of background to this story. 📖</p>\n<p>Back in September 2021, our first full-time team member was <a href=\"https://x.com/josedonato__?utm_source=didierlopes.beehiiv.com&amp;utm_medium=referral&amp;utm_campaign=openbb-mobile-app-coming-soon\">Jose Donato</a>. He started full-time, even before I did (due to my 3 months notice period in Europe, yikes).</p>\n<p>We met through Reddit, only to discover that we are both Portuguese and our hometowns aren’t far from each other.</p>\n<p>I’ve learned more from him about web development than from any YouTube, tutorial or book - combined.</p>\n<p>One of the topics he was very passionate about, was the concept of Progressive Web Apps (PWAs). So much so, that he talked about it in his thesis (<a href=\"https://jose-donato.deno.dev/master_thesis.pdf?utm_source=didierlopes.beehiiv.com&amp;utm_medium=referral&amp;utm_campaign=openbb-mobile-app-coming-soon\">2.2 native applications</a>).</p>\n<p>I had never heard of it before, but the concept intrigued me. Why wouldn’t more companies do that?</p>\n<p>Jose is currently writing a post about it, you can subscribe to the <a href=\"https://openbb.co/newsletter?utm_source=didierlopes.beehiiv.com&amp;utm_medium=referral&amp;utm_campaign=openbb-mobile-app-coming-soon\">company newsletter</a> to keep an eye out for it.</p>\n<h2 id=\"mobile-compatibility\">Mobile compatibility</h2>\n<p>Fast forward to September 3rd, 2024. 🏃‍♂️</p>\n<p>We are 1 week away from one of the biggest launches in the company. Earlier surprise for my subscribers, but we are about to announce a free version of our enterprise product.</p>\n<p>A web app that allows users to bring any type of data and have access to an agent to interact with all these different datasets to extract patterns, trends and insights.</p>\n<p>This web app has been built over 2 years and all workflows, tests, and iterations have been done for desktop usage.</p>\n<p>Jose sent me a video of a mobile version somewhat polished. It had the same UX as the terminal, but it rendered nicely on mobile.</p>\n<p align=\"center\"><img width=\"900\" src=\"https://didierlopes.com/blog/2024-10-05-openbb-mobile-app-coming-soon_2.png\"></p>\n<p>Given that we were aiming at adoption, he believed it was important for users to be able to access the terminal through their phones on the web.</p>\n<p>And so over 2 weeks, he spent no more than 3h polishing the mobile version.</p>\n<h2 id=\"mobile-ux\">Mobile UX</h2>\n<p>On the 23rd of September, I pinged <a href=\"https://www.linkedin.com/in/ana-rita-soares-48b247152/?utm_source=didierlopes.beehiiv.com&amp;utm_medium=referral&amp;utm_campaign=openbb-mobile-app-coming-soon\">Rita Soares</a> - our lead UI/UX.</p>\n<p>I had been thinking about mobile user experience and wasn’t happy that we just adapted the interface to work with mobile. But, mobile represents a completely different paradigm on how we use a product. The screen space, the speed at which you can type, not necessarily used for work, more distractions, etc…</p>\n<p>So, I asked Rita to create a few mobile mockups for me - the idea was to improve the UX to make the copilot shine. I.e. more front and center and have the data visualization pushed more to the background.</p>\n<p>That same evening, she shared these mockups with me:</p>\n<p align=\"center\"><img width=\"900\" src=\"https://didierlopes.com/blog/2024-10-05-openbb-mobile-app-coming-soon_3.png\"></p>\n<p>I promptly shared in a group with her and Jose - this was 7:35 pm my time, which would be 0:35 am their time.</p>\n<p align=\"center\"><img width=\"900\" src=\"https://didierlopes.com/blog/2024-10-05-openbb-mobile-app-coming-soon_4.png\"></p>\n<p>In less than 24 hours the bulk of the mockups had been implemented.</p>\n<p align=\"center\"><img width=\"900\" src=\"https://didierlopes.com/blog/2024-10-05-openbb-mobile-app-coming-soon_5.png\"></p>\n<h3 id=\"progressive-web-apps-pwas\">Progressive Web Apps (PWAs)</h3>\n<p>On that same day, after Jose shared the bulk of mockups implemented.</p>\n<p>I sent him this message at 8:55 pm EST (1:55 am Portugal time for Jose).</p>\n<p align=\"center\"><img width=\"900\" src=\"https://didierlopes.com/blog/2024-10-05-openbb-mobile-app-coming-soon_7.png\"></p>\n<p>To which he replied:</p>\n<p align=\"center\"><img width=\"900\" src=\"https://didierlopes.com/blog/2024-10-05-openbb-mobile-app-coming-soon_8.png\"></p>\n<p>I was right, it didn’t take him 30s. But it didn’t take him much longer (15 minutes).</p>\n<p align=\"center\"><img width=\"900\" src=\"https://didierlopes.com/blog/2024-10-05-openbb-mobile-app-coming-soon_9.png\"></p>\n<p>15 minutes to have OpenBB as an application on my phone.</p>\n<p>I was mind-blown.</p>\n<p>We iterated on it for an additional 1h30m together, until we had something we would be proud to share with the team the following day.</p>\n<p align=\"center\"><img width=\"300\" src=\"https://didierlopes.com/blog/2024-10-05-openbb-mobile-app-coming-soon_10.png\"></p>\n<p>We still had to iterate on a few more areas and involve more people from the team. But the bulk of the mobile app was done.</p>\n<p>In pretty much 1 evening.</p>\n<p>With 1 person.</p>\n<h3 id=\"conclusion\">Conclusion</h3>\n<p>I could tell you that this doesn’t happen often, but it does.</p>\n<p>Small, highly motivated teams (or individuals like Jose) with a strong initiative and a drive to make a difference, can have a tremendous impact on the company.</p>\n<p>I hope this post inspires more builders to share behind the scenes on how great products/features are built and how serendipity can play a role in it.</p>",
            "url": "https://didierlopes.com/blog/openbb-mobile-app-coming-soon",
            "title": "OpenBB Mobile App - Coming soon!",
            "summary": "How we built a mobile app, in 1 evening, with 1 engineer.",
            "date_modified": "2024-10-05T00:00:00.000Z",
            "tags": [
                "openbb",
                "mobile",
                "pwa",
                "web-development",
                "ux",
                "engineering"
            ]
        },
        {
            "id": "https://didierlopes.com/blog/chatgpt-and-the-future-of-ai-in-finance",
            "content_html": "<p align=\"center\"><img width=\"900\" src=\"https://didierlopes.com/blog/2024-09-21-chatgpt-and-the-future-of-ai-in-finance.jpg\"></p>\n<p>I took the stage at the Cornell Quant Conference alongside Yu Yu (BlackRock) Tony Berkman (Two Sigma), and Samson Qian (Citadel), to discuss ChatGPT &amp; The Future of AI in Finance.</p>\n<div style=\"border-top:1px solid #0088CC;margin:1.5em 0\"></div>\n<p>Last week, I participated in a panel at the Cornell Financial Engineering Manhattan Conference. The topic of the panel was ‘ChatGPT &amp; The Future of AI in Finance.’</p>\n<p>The other panelists were:</p>\n<ul>\n<li><strong>Yu Yu</strong>, Director of Data Science - BlackRock</li>\n<li><strong>Tony Berkman</strong>, Managing Director - Two Sigma</li>\n<li><strong>Samson Qian</strong>, Trader - Citadel</li>\n</ul>\n<p>After the discussion, several people reached out, mentioning it was one of their favorite panels of the day.</p>\n<p>Since this wasn't recorded, I took the opportunity to write down some of the topics discussed, along with a few additional thoughts that I believe in.</p>\n<p>I will organize the following sections based on the topics discussed at the event:</p>\n<ol>\n<li>Hallucinations</li>\n<li>Agents are the future</li>\n<li>When does it make sense to fine-tune?</li>\n<li>Compliance and Data security</li>\n</ol>\n<h2 id=\"1-hallucinations\">1. Hallucinations</h2>\n<p>When talking about the topic of hallucinations, I have a <a href=\"https://x.com/didier_lopes/status/1675630822093918209\">quote</a> that I love from Marc Andreesen:</p>\n<blockquote>\n<p>“Hallucination is what we call when we don't like it. Creativity is what we call it when we do like it.”</p>\n</blockquote>\n<h3 id=\"confident-hallucinations\">Confident hallucinations</h3>\n<p>The fundamental issue with hallucinations is the fact that the model hallucinates with confidence.</p>\n<p>Imagine asking two different friends: “Do you know where location X is?”</p>\n<p><strong>Friend A</strong>: It’s there.</p>\n<p><strong>Friend B</strong>: Hmm, I’m not really sure. If I had to guess, I’d say there, but I’m not 100% certain.</p>\n<p>If both gave wrong directions, you would consider <strong>Friend A</strong> a liar, but not Friend B. This is because <strong>Friend B</strong> lacked confidence in their answer, they were trying to help but highlighted that they weren’t sure about it.</p>\n<p>The problem with current LLMs is that they are, for the most part, like <strong>Friend A</strong>. They say wrong things with certainty.</p>\n<p>Hallucinations would be less problematic if the default behavior were more like the answer on the right, when the LLM is not 100% confident.</p>\n<div class=\"flex justify-center items-center\"><img width=\"350\" src=\"https://didierlopes.com/blog/2024-09-21-chatgpt-and-the-future-of-ai-in-finance_1.png\" style=\"margin-right:10px\"><img width=\"350\" src=\"https://didierlopes.com/blog/2024-09-21-chatgpt-and-the-future-of-ai-in-finance_2.png\"></div>\n<br>\n<p>The problem with confident hallucinations is that, similar to why everyone dislikes liars, it leads to a lack of trust. So users begin to put everything that is output by an LLM under a microscope - even if what the model says is accurate.</p>\n<h3 id=\"how-to-avoid-hallucinations\">How to avoid hallucinations</h3>\n<p>There are ways to address this and one of the key approaches we are extremely strong about at OpenBB is always tapping into information that is available.</p>\n<p>When a user asks a question that requires financial data, the OpenBB Copilot always searches for that data on OpenBB (either through data we make available or through private data that customers bring).</p>\n<p>The Copilot will only answer the question if that data exists. This allows the model to cite the data used in its response, so the user can double-check.</p>\n<p>This is how it looks.</p>\n<p align=\"center\"><img width=\"900\" src=\"https://didierlopes.com/blog/2024-09-21-chatgpt-and-the-future-of-ai-in-finance_3.png\"></p>\n<p>While I've heard a few vendors promising 100% accuracy, this is simply not true.</p>\n<p>We are at a stage where technology is not even yet at the ‘trust but verify’ level.</p>\n<p>So instead of hallucinating with confidence, when data is unavailable, we prompt the model to return that there was no real-time information accessible to answer the query.</p>\n<p align=\"center\"><img width=\"900\" src=\"https://didierlopes.com/blog/2024-09-21-chatgpt-and-the-future-of-ai-in-finance_4.png\"></p>\n<h3 id=\"function-calling-to-increase-accuracy\">Function calling to increase accuracy</h3>\n<p>One thing we found that significantly reduces hallucinations is enabling our agent, OpenBB Copilot, to have access to all the API backends that users have through OpenBB or those they've added themselves.</p>\n<p>Here’s the sequence of actions that happen:</p>\n<ol>\n<li>The user asks the OpenBB Copilot a question.</li>\n<li>The prompt is converted into embeddings.</li>\n<li>We compare that embedding with all the ones that we have on an OpenBB vector store which contains widget signatures - name, description, category, subcategory and source.</li>\n<li>We retrieve the widgets with the highest similarity.</li>\n<li>The Copilot then decides which widget to use based on the prompt.</li>\n<li>Then Copilot also decides what parameters to use when calling that API</li>\n</ol>\n<br>\n<p>This leads to less hallucination because the LLM isn't outputting tokens based on a prompt and its internal weights. Instead, it's using its internal weights, the prompt, and a function call.</p>\n<p>Assuming the function call succeeds - with correct widget retrieval and parameters - the data becomes available for the Copilot to use, which leads to higher accuracy.</p>\n<p>Note: This still means that Copilot needs to use the correct widget and the correct parameter, but there's a <strong>higher likelihood of success</strong> because if it isn't, the API call will fail, prompting the LLM to try again.</p>\n<p>Here's how it works behind the scenes, the OpenBB Copilot highlights its step-by-step reasoning so users can understand its thought process. Transparency is key.</p>\n<p align=\"center\"><img width=\"900\" src=\"https://didierlopes.com/blog/2024-09-21-chatgpt-and-the-future-of-ai-in-finance_5.png\"></p>\n<h3 id=\"workflows-to-avoid-hallucinations\">Workflows to avoid hallucinations</h3>\n<p>In order to reduce the number of hallucinations, there are two things that can be done.</p>\n<h4 id=\"enable-users-to-quickly-detect-whether-a-hallucination-has-occurred\">Enable users to quickly detect whether a hallucination has occurred</h4>\n<p>For instance, if a user utilizes the following prompt on the OpenBB Copilot:</p>\n<blockquote>\n<p><em>Using&nbsp;the&nbsp;earnings&nbsp;transcript,&nbsp;create&nbsp;a&nbsp;table&nbsp;with&nbsp;columns:&nbsp;financial&nbsp;metric,&nbsp;value,&nbsp;sentence&nbsp;in&nbsp;the&nbsp;earnings&nbsp;where&nbsp;it&nbsp;was&nbsp;extracted&nbsp;from.&nbsp;Double&nbsp;check&nbsp;whether&nbsp;the&nbsp;information&nbsp;you&nbsp;are&nbsp;using&nbsp;is&nbsp;correct.</em></p>\n</blockquote>\n<br>\n<p>They get the \"<em>Sentence Extracted From</em>\" column, which they can copy and paste into a search field added at the top of the Earnings Transcript widget. This enable users to quickly validate the numbers that have been found.</p>\n<p>See example below,</p>\n<p align=\"center\"><img width=\"900\" src=\"https://didierlopes.com/blog/2024-09-21-chatgpt-and-the-future-of-ai-in-finance_6.png\"></p>\n<h4 id=\"add-deterministic-processes-to-check-for-hallucinations\">Add deterministic processes to check for hallucinations</h4>\n<p>For example, let’s say the user prompt involves a data retrieval task.</p>\n<p>We can run a deterministic process to check whether the retrieved values exist or not. Sure this won't be 100% accurate because the numbers could be flagged by referring to another thing, BUT it's all about improving the overall accuracy of Copilot.</p>\n<p>Ultimately, whatever can be done to improve the Copilot’s accuracy should be done.</p>\n<h2 id=\"2-agents-are-the-future\">2. Agents are the future</h2>\n<p>When we think about how humans operate, we recognize that the brain coordinates all the actions of our body and our thought processes. This is similar to how agents work.</p>\n<p>If I'm playing soccer, the muscles I use are different from those I would use if I were boxing. If I'm programming, the parts of my brain I use differ from those I would use when listening to music.</p>\n<p>However, it's not as simple as \"activity A requires legs\". Most of your body and mind are always involved, but at different times and in different capacities. And what dictates that are external factors.</p>\n<p>For instance, if I am playing soccer as a winger and my team is attacking, I will likely be using both legs to run forward and a lot of mental energy to decide where to position myself on the field.</p>\n<p>And that will change a lot based on where the ball is. If the ball is on the opposite side, I'll likely run less and stay more in the middle to be ready for a counterattack. If the ball is in the middle, I'll probably be running at full speed to create space. If the ball is close to me I have to worry more about controlling it and understand what I can do with it next.</p>\n<p>The environment affects my plan to carry out an action where I want to have a successful outcome.</p>\n<p><strong>This is how agents work.</strong></p>\n<p>Agents aren't just about a single LLM performing well, but about a full workflow that interacts with multiple language models, function calls, or any other process to carry an action.</p>\n<p>At the core, the biggest advantage of an agent over a LLM is that an agent has a full feedback loop. It understands the impact of the LLM output and can use that data in the next step of the process. Whereas a single LLM API call returns its best output but won't know how that affected the external environment.</p>\n<p>This is why, at OpenBB, we believe in compound AI systems.</p>\n<p>And apparently, <a href=\"https://finance.yahoo.com/news/sequoia-sees-bigger-money-ai-203655254.html?guccounter=1\">so does Sequoia</a>.</p>\n<p align=\"center\"><img width=\"300\" src=\"https://didierlopes.com/blog/2024-09-21-chatgpt-and-the-future-of-ai-in-finance_7.png\"></p>\n<h3 id=\"the-strawberry-issue-will-be-solved\">The “Strawberry” issue will be solved</h3>\n<p>A panelist commented on stage that LLMs can’t even count how many R's are in the word \"Strawberry\".</p>\n<p>This <a href=\"https://x.com/MwangoCapital/status/1828857579860095428\">tweet</a> offers a good explanation of why this happens — it turns out it's due to the tokenizer, and it can be solved. In fact, it's solved by simply ensuring that the model takes each letter as a token. See below,</p>\n<div class=\"flex justify-center items-center\"><img width=\"300\" src=\"https://didierlopes.com/blog/2024-09-21-chatgpt-and-the-future-of-ai-in-finance_8.png\" style=\"margin-right:10px\"><img width=\"300\" src=\"https://didierlopes.com/blog/2024-09-21-chatgpt-and-the-future-of-ai-in-finance_9.png\"></div>\n<br>\n<p>This means that the model's output can be improved by doing extra work at the input level.</p>\n<p>Data cleaning and pre-processing strikes again? 😃</p>\n<p>Interestingly, a few days ago, <a href=\"https://openai.com/o1/\">OpenAI announced OpenAI o1</a>. Which is basically GPT-4o with Chain-of-Thought (COT). This means that this model is a \"wannabe agent\".</p>\n<p>It takes in a prompt from the user and decomposes it in natural steps to solve it. Then at each step, it takes the output of the model from the previous step and predicts the next token. It turns out that this improves accuracy substantially.</p>\n<p>However, it still doesn’t have access to external data. And that is why I call it a \"wannabe agent\".</p>\n<p>I love how Jeremiah put it in this <a href=\"https://x.com/jlowin/status/1834722014839418962\">tweet</a>:</p>\n<blockquote>\n<p>(...) Agents are also characterized by iterative behavior. But there's a key difference: while models like o1 iterate internally to refine their reasoning, agents engage in iterative interactions with the external world. They perceive the environment, take actions, observe the outcomes (or side effects) and adjust accordingly. This recursive process enables agents to handle tasks that require adaptability and responsiveness to real-world changes. (...)</p>\n</blockquote>\n<br>\n<p>So, o1's model isn't an agent - but it can solve this problem. The reason is that it applies its own data cleaning/pre-processing step on its own, and doesn't rely on external factors.</p>\n<h3 id=\"small-language-models\">Small Language Models</h3>\n<p>Once agents work, Small Language Models (SLM) will be much more viable for very specific use cases.</p>\n<p>In logical terms, a Large Language Model is a model with weights.</p>\n<p>Large means that it has a lot of them. But what tends to happen is LLMs need to be very big because they want these models to be really good at everything. The problem is that if you want the exact same model to be good at discussing soccer, programming, and speaking Portuguese, its weights are updated using these drastically different datasets. Now the premise is that the more weights there are, the less each weight will be affected by data from completely different domains.</p>\n<p>What a big LLM like GPT-4o is doing is trying to build a single Jarvis that knows about everything. Whereas we could have an SLM that does something extremely well and just focus on that, e.g. translating from English to Portuguese. The benefit of an SLM is that inference is likely faster, can be hosted on devices, and, in theory, it's better on a topic because it's been less \"contaminated\" during training by data that doesn't relate to the task at hand.</p>\n<p>Imagine that a firm decides to use an SLM trained to retrieve data from SEC filings quickly and at scale. Or, we could train our own SLM to understand user intent and interact directly with the OpenBB Terminal interface.</p>\n<h3 id=\"large-language-models-as-orchestrator\">Large Language Models as orchestrator</h3>\n<p>In my opinion, the best LLM in each category will win. And the second and third won't matter. It's a winner-takes-all kind of market. Unless in specific verticals such as inference time or open weights (e.g. for data security; more on this later).</p>\n<p>The best example of this is OpenAI vs Anthropic.</p>\n<p>I had been using OpenAI's GPT-4 for coding for several months. After trying Anthropic's Sonnet 3.5 for coding, I never went back to OpenAI.</p>\n<p align=\"center\"><img width=\"400\" src=\"https://didierlopes.com/blog/2024-09-21-chatgpt-and-the-future-of-ai-in-finance_10.png\"></p>\n<p>The market share for the best LLM will be gigantic. That’s why <a href=\"https://www.bloomberg.com/news/articles/2024-09-11/openai-fundraising-set-to-vault-startup-s-value-to-150-billion\">OpenAI is looking to raise at a $150 billion valuation</a>. While the valuation reflects the market size, the amount that will be raised represents the capital needed to reach that valuation. This is why only a few players will be able to compete at that level.</p>\n<p>In an \"agentic future\", I believe the best LLM will serve as the core \"brain\" - the main LLM that routes all prompts and decides what happens next.</p>\n<p>And who wouldn't want the smartest model controlling the actions with a list of models, functions and data at its disposal?</p>\n<p>I know I would.</p>\n<p>That's also why, when discussing OpenBB Copilot, we don’t rely on a single foundational model. Instead, we use the models that are best suited for each specific task.</p>\n<p>For instance, OpenAI o1 can be the brains, but when a user uses @web it triggers the Perplexity model, and when they upload an image, we have Anthropic's Haiku. Or maybe if they want to do intraday trading, we use Llama 3.1 through Groq for fast inference.</p>\n<p>You get the idea.</p>\n<h2 id=\"3-when-does-it-make-sense-to-fine-tune\">3. When does it make sense to fine-tune</h2>\n<p>A good comment was made on the panel: \"<em>it’s expensive to spend time fine-tuning a new model, just for that entire work to be 'eradicated' by a new model that has a higher performance in that specific domain than the model has been fine-tuned</em>\".</p>\n<p>In my opinion, this happens because the timing isn't right yet. We are still unlocking remarkable achievements through each new model release. Although there is a massive bump in terms of capability between these releases, I wouldn't recommend that a firm fine-tune its own models at this stage.</p>\n<p>However, at some point, whether due to a lack of data to train or architecture needing to be reinvented, improvements in LLM performance won't be substantial - they may not even be noticeable. This is when the fine-tuning technique becomes relevant because at this stage you are trying to repurpose everything the model has towards a specific vertical / use-case - and at that vertical/use-case that model will be better than the following one.</p>\n<p>Then after some new models come out, you may consider reapplying fine-tuning to that model, but this would likely be years later, not weeks or months. So, the ROI can be quite high. Particularly when you are trying to win in your specific market.</p>\n<p>This is how I see it working in my head:</p>\n<p align=\"center\"><img width=\"900\" src=\"https://didierlopes.com/blog/2024-09-21-chatgpt-and-the-future-of-ai-in-finance_11.png\"></p>\n<h2 id=\"4-compliance-and-data-security\">4. Compliance and Data security</h2>\n<p>Another question I received was about compliance and data security.</p>\n<p>Recently, during a discussion with one of the largest hedge funds in the world, we were asked about the entire workflow of the data when our AI Copilot has access to it.</p>\n<p>Their main concern was ensuring that no data was being shared with third-party vendors like OpenAI. For such firms, their data is their alpha, and keeping it within their network is paramount.</p>\n<p>Crypto enthusiasts often say, \"Not your keys, not your coins\" to emphasize the importance of storing assets in a cold wallet rather than leaving them on an exchange that might implode (looking at you, FTX). The same principle applies here: \"Not your weights, not your data\".</p>\n<p>When you send information to a large foundation model provider like OpenAI, your data enters their ecosystem, and you have to trust they’ll honor the terms of your contract.</p>\n<p>A more secure approach is to host an open-source model locally within your firm, ensuring that sensitive data remains entirely within your infrastructure and network.</p>\n<p>Although open-source models aren’t yet as powerful as closed-source ones, they are catching up quickly. If you think that GPT-4o can already do a lot for you, think about how at some point there will be an open-source model that is GPT-4o equivalent. Sure, at that time closed-source models will be better, but the question is: How much better?</p>\n<p>Or better, the question is: <strong>\"How much are you willing to sacrifice in terms of data security for performance?”</strong>.</p>\n<p>At OpenBB, we take this very seriously and have taken measures to allow enterprise customers to fully control their data.</p>\n<h3 id=\"bring-your-own-copilot\">Bring your own copilot</h3>\n<p>Enable firms to bring their own LLMs to access data within OpenBB. This means that we provide an interface for research, but also allow them to integrate their internal LLMs and interact directly with it from OpenBB.</p>\n<div class=\"flex justify-center items-center\"><img width=\"350\" src=\"https://didierlopes.com/blog/2024-09-21-chatgpt-and-the-future-of-ai-in-finance_12.png\" style=\"margin-right:10px\"><img width=\"350\" src=\"https://didierlopes.com/blog/2024-09-21-chatgpt-and-the-future-of-ai-in-finance_13.png\"></div>\n<br>\n<p>We believe in this idea so much, that we have open-source the architecture for firms to bring their own Copilot to OpenBB. More information is available <a href=\"https://github.com/OpenBB-finance/copilot-for-terminal-pro/\">here</a>.</p>\n<h3 id=\"turn-off-ai-workflows\">Turn off AI workflows</h3>\n<p>We have incorporated workflows that make users' lives MUCH better. But they come at a cost: sharing data with an LLM provider.</p>\n<p>These are the features:</p>\n<ul>\n<li><strong>Widget title/description suggestion from Copilot</strong>: This sends the content of the table or note output by Copilot to an LLM provider to receive suggestions of a title and description.</li>\n</ul>\n<p align=\"center\"><img width=\"600\" src=\"https://didierlopes.com/blog/2024-09-21-chatgpt-and-the-future-of-ai-in-finance_14.png\"></p>\n<ul>\n<li><strong>Widget title/description suggestion upon upload</strong>: It sends the content of the file that has been uploaded to an LLM provider to receive suggestions of title and description.</li>\n</ul>\n<p align=\"center\"><img width=\"600\" src=\"https://didierlopes.com/blog/2024-09-21-chatgpt-and-the-future-of-ai-in-finance_15.png\"></p>\n<ul>\n<li><strong>Copilot chat title generation</strong>: Upon the first user prompt, the content is sent to an LLM provider to update the chat title, reflecting the nature of the conversation.</li>\n</ul>\n<p align=\"center\"><img width=\"600\" src=\"https://didierlopes.com/blog/2024-09-21-chatgpt-and-the-future-of-ai-in-finance_16.png\"></p>\n<ul>\n<li><strong>Dashboard name generation</strong>: When renaming the dashboard, we send the title and descriptions of all widgets on that dashboard to an LLM provider, to ensure that the suggested name is relevant.</li>\n</ul>\n<p align=\"center\"><img width=\"600\" src=\"https://didierlopes.com/blog/2024-09-21-chatgpt-and-the-future-of-ai-in-finance_17.png\"></p>\n<p>To allow firms to keep their data within their network, one of our enterprise features is the option to disable these AI workflows.</p>\n<p align=\"center\"><img width=\"900\" src=\"https://didierlopes.com/blog/2024-09-21-chatgpt-and-the-future-of-ai-in-finance_18.png\"></p>\n<p>In the future, we could direct these AI workflows to use an LLM that our customers are running locally.</p>\n<h2 id=\"so-in-a-nutshell-what-can-you-expect-from-openbb\">So, in a nutshell, what can you expect from OpenBB?</h2>\n<p>We are building an AI-powered research workspace.</p>\n<p>At the core it is an AI compound system, where users can bring their own data (structured, unstructured, API, custom backend, database, data warehouse, etc..) and have our (or their own copilot) access all this data seamlessly - in an interface that is customizable, flexible and enables teams to work together.</p>\n<p>If you want to learn more, e-mail me directly at <a href=\"mailto:didier.lopes@openbb.finance\">didier.lopes@openbb.finance</a></p>",
            "url": "https://didierlopes.com/blog/chatgpt-and-the-future-of-ai-in-finance",
            "title": "ChatGPT and The Future of AI in Finance",
            "summary": "I took the stage at the Cornell Quant Conference alongside Yu Yu (BlackRock) Tony Berkman (Two Sigma), and Samson Qian (Citadel), to discuss ChatGPT & The Future of AI in Finance.",
            "date_modified": "2024-09-21T00:00:00.000Z",
            "tags": [
                "finance",
                "ai",
                "agents",
                "chatgpt",
                "quant",
                "cornell",
                "twosigma",
                "blackrock",
                "citadel"
            ]
        },
        {
            "id": "https://didierlopes.com/blog/why-i-love-boxing",
            "content_html": "<p align=\"center\"><img width=\"300\" src=\"https://didierlopes.com/blog/2024-09-09-why-i-love-boxing.jpeg\"></p>\n<p>Exploring the parallels between boxing and startup life, and how both push me beyond my comfort zone to foster personal growth, resilience, and continuous learning.</p>\n<div style=\"border-top:1px solid #0088CC;margin:1.5em 0\"></div>\n<p>Recently, I finished reading “The Art of Learning” - a really good book that I’ve recommend to everyone (btw, <a href=\"https://x.com/didier_lopes/status/1742748040220328189?s=20\">here</a> is a page of all the books I’ve read in the past few years).</p>\n<p>In it, the author Josh Waitzkin, reflects on his journey from chess champion to martial arts practicioner - and how anyone can master the art of learning.</p>\n<p align=\"center\"><img width=\"300\" src=\"https://didierlopes.com/blog/2024-09-09-why-i-love-boxing_1.png\"></p>\n<p>It made me wonder, why at 29 years old did I decide to step into a ring with boxers who have been fighting for 10+ years? 🥊</p>\n<p>As my friend Max says, “You don’t play boxing”. So why am I doing it?</p>\n<p>Similar to setting up a startup, this isn’t something that’s easy to explain. The most rationale thing to do would be to go for a run outside or just go to the gym.</p>\n<p>Yet, I hop in a ring to fight.</p>\n<p>Why?</p>\n<p>For starters, there’s something thrilling about stepping into the ring and knowing that you are going to get punched.</p>\n<p>You need to get comfortable with something that - by definition - it’s uncomfortable.</p>\n<h2 id=\"boxing-is-the-physical-to-what-startups-are-for-the-mind\">Boxing is the physical to what startups are for the mind</h2>\n<p>Think about it. Most activities that people do in their spare time have a “controlled” level of intensity. You get progressively more tired but “know” it’s coming - e.g. gym, swimming, tennis, running, etc.</p>\n<p>Contact sports are in general like this too, although every now and then you can get injured. Although this rate is small, and sports in general equip athletes to be protected against injuries.</p>\n<p>Boxing (and martial arts) don’t work this way. You step in the ring and within the first few seconds, you may get a hook that gives you a bruise next to your eye or a uppercut that makes you stop breathing for a few seconds.</p>\n<p>My point is that with boxing, you don’t know when you are going to get hurt, but you learn to be comfortable with it and over time your body gets used to that level of pain - so it will take even more to make you uncomfortable.</p>\n<p align=\"center\"><img width=\"600\" src=\"https://didierlopes.com/blog/2024-09-09-why-i-love-boxing_2.png\"></p>\n<h2 id=\"first-sparring-session\">First sparring session</h2>\n<p>I still remember my first sparring session, I got hit on the nose and had tears coming out of my eyes from it. My nose hurt for 3 days in a row. It doesn’t matter how many times the coach told me to keep my hands up, nothing taught me quicker than that cross on my nose.</p>\n<p>For the remainder of the fight, I was mostly protecting myself and keeping my distance. I was “humbled” by the other fighter, and was pushed to outside my comfort zone.</p>\n<p>This is not so much different from startup life where mentally you have to be in uncomfortable places - for me this is the equivalent to speaking on a stage. For an introvert like myself, that was something that was hard to overcome. Although I am still not comfortable on a stage, I am much more comfortable than I used to be.</p>\n<p align=\"center\"><img width=\"600\" src=\"https://didierlopes.com/blog/2024-09-09-why-i-love-boxing_3.png\"></p><p style=\"font-size:0.8em\">Presenting at CIBC a few weeks ago at New York AI meetup</p><p></p>\n<h2 id=\"next-sparring-sessions\">Next sparring sessions</h2>\n<p>Currently when I step in a ring I have mixed feelings, I’m somewhat anxious but also excited about it.</p>\n<p>It’s weird.</p>\n<p>I mean, I know full well that I’m going against folks who’ve been in a ring since they were young - and I also know full well that I’m going to get hit much more than I will hit.</p>\n<p><strong>However</strong>, there’s something exciting (poetic maybe?) about knowing that each time I step into the ring again, I will be able to land more punches, avoid more hits and be better mentally.</p>\n<p>Learning is the nature of the game.</p>\n<p>And the only failure is to not take any lessons from each fight.</p>\n<p>This is the same for startups. I like what Bezos has to say on the topic, about <a href=\"https://www.youtube.com/shorts/HmYj-UDT8jM\">pushing Amazon to embrace failure</a>.</p>\n<p align=\"center\"><img width=\"300\" src=\"https://didierlopes.com/blog/2024-09-09-why-i-love-boxing_4.JPG\"></p><p style=\"font-size:0.8em\">This picture was what convinced me to buy my own head gear</p><p></p>\n<h2 id=\"so-why-do-i-love-boxing\">So, why do I love boxing?</h2>\n<p>I think ultimately, the reason why I love boxing is the same as why I love startups.</p>\n<p>Startups push me everyday to be the best that I can be in so many different areas, there isn’t a role that - for me - is as stimulating mentally as being a startup founder.</p>\n<p>There are 100 different initiatives ongoing at all times, you have a team of composed of human beings (by nature, highly complex with different backgrounds and life experiences), you have startups trying to disrupt your business, you have well established incumbents, etc..</p>\n<p>Boxing is the same... but at the physical level.</p>\n<p>I step in the ring and need to be the best I can in multiple verticals - it isn’t enough to be the best in one.</p>\n<p>I need to have a faster reaction to avoid punches, be light on my feet to surprise an opponent, land the combos where I put most of my energy in, trade-off balance between combos and stamina, and obviously all the mental side that comes from it too - which turns out is quite a lot.</p>\n<p>Ultimately, as cheesy as it sounds, being a startup founder and doing boxing make me feel alive.</p>\n<p align=\"center\"><img width=\"300\" src=\"https://didierlopes.com/blog/2024-09-09-why-i-love-boxing_5.jpeg\"></p><p style=\"font-size:0.8em\">Taking my father-in-law for a class</p><p></p>",
            "url": "https://didierlopes.com/blog/why-i-love-boxing",
            "title": "Why I love boxing",
            "summary": "Exploring the parallels between boxing and startup life, and how both push me beyond my comfort zone to foster personal growth, resilience, and continuous learning.",
            "date_modified": "2024-09-09T00:00:00.000Z",
            "tags": [
                "boxing",
                "startups",
                "learning",
                "growth"
            ]
        },
        {
            "id": "https://didierlopes.com/blog/what-i-learned-in-3-years-at-openb",
            "content_html": "<p align=\"center\"><img width=\"600\" src=\"https://didierlopes.com/blog/2024-08-20-what-i-learned-in-3-years-at-openb.jpeg\"></p>\n<p>The OpenBB journey started officially 3 years ago.</p>\n<p>So I want to celebrate it by sharing 36 lessons I learned over the past 36 months as a founder and CEO of a fintech company.</p>\n<div style=\"border-top:1px solid #0088CC;margin:1.5em 0\"></div>\n<p>The OpenBB journey started officially 3 years ago.</p>\n<p>So I want to celebrate it by sharing 36 lessons I learned over the past 36 months as a founder and CEO of a fintech company.</p>\n<ol>\n<li>\n<p>Be curious.</p>\n</li>\n<li>\n<p>Talk to users.</p>\n</li>\n<li>\n<p>Protect your time.</p>\n</li>\n<li>\n<p>Do the right thing.</p>\n</li>\n<li>\n<p>Culture is everything.</p>\n</li>\n<li>\n<p>Energy is contagious.</p>\n</li>\n<li>\n<p>Hire slow and fire fast.</p>\n</li>\n<li>\n<p>Write everything down.</p>\n</li>\n<li>\n<p>Reward people who care.</p>\n</li>\n<li>\n<p>Celebrate every little win.</p>\n</li>\n<li>\n<p>Work on your storytelling.</p>\n</li>\n<li>\n<p>Ship often and iterate fast.</p>\n</li>\n<li>\n<p>Listen more than you speak.</p>\n</li>\n<li>\n<p>Be comfortable with saying no.</p>\n</li>\n<li>\n<p>When in doubt, there's no doubt.</p>\n</li>\n<li>\n<p>Over communicate with the team.</p>\n</li>\n<li>\n<p>Have an inherent sense of urgency.</p>\n</li>\n<li>\n<p>Don't overthink, estimate and iterate.</p>\n</li>\n<li>\n<p>Failing is ok, not learning from it isn't.</p>\n</li>\n<li>\n<p>Measure success by impact, not effort.</p>\n</li>\n<li>\n<p>Do not run away from hard conversations.</p>\n</li>\n<li>\n<p>Having common sense is a very powerful skill.</p>\n</li>\n<li>\n<p>How you do anything is how you do everything.</p>\n</li>\n<li>\n<p>It's not because you can build it that you should.</p>\n</li>\n<li>\n<p>Seeing your vision materialize gives goosebumps.</p>\n</li>\n<li>\n<p>Be so excited in your product that users can feel it.</p>\n</li>\n<li>\n<p>Lack of focus is likely the biggest risk you face as a company.</p>\n</li>\n<li>\n<p>It turns out that there's a ton of data in your gut feeling.</p>\n</li>\n<li>\n<p>Make people accountable for both successes and failures.</p>\n</li>\n<li>\n<p>Hiring is the most important thing you will do at your company.</p>\n</li>\n<li>\n<p>Create a culture where feedback is not only welcome but expected.</p>\n</li>\n<li>\n<p>Work side-by-side with the team on things that are considered \"boring\".</p>\n</li>\n<li>\n<p>Be there for your team when they need you, they will repay you with loyalty.</p>\n</li>\n<li>\n<p>One of the worst things you can do is optimizing something that shouldn't exist.</p>\n</li>\n<li>\n<p>Vast majority of decisions are 2-way door decisions. Make a decision and move on.</p>\n</li>\n<li>\n<p>Startups are hard and fun. Working with people you like makes it less hard and more fun.</p>\n</li>\n</ol>\n<br>\n<p>In the past 3 years, we have:</p>\n<ul>\n<li>The <a href=\"https://github.com/OpenBB-finance/OpenBB\">open source repo</a> has been starred over 28,000 times and 220 contributors</li>\n<li>The OG OpenBB Terminal installer was downloaded over 150k times</li>\n<li>Refactored that application to a platform that could be pip installable</li>\n<li>Enabled users to fully <a href=\"https://youtu.be/cgeN3Ep2nEw?si=8e5en_xunWcBdKMM\">automate their research workflow in a script</a></li>\n<li>Open-sourced an <a href=\"https://github.com/OpenBB-finance/openbb-agents\">LLM-powered financial analyst agent built on top of the OpenBB platform</a></li>\n<li>Made an <a href=\"https://openbb.co/products/bot\">OpenBB Bot</a> that run over 4M commands in 20k+ servers with 50k+ users</li>\n<li>Developed an <a href=\"https://openbb.co/products/excel\">Add-in for Excel</a></li>\n<li>Grew to a team of 16</li>\n<li>Built a community of over 100k people</li>\n<li>And finally, we built the foundation of the <a href=\"https://openbb.co/products/pro\">first AI-powered financial terminal</a> - more on this very very soon.</li>\n</ul>\n<br>\n<p>Personally, during that timeline:</p>\n<ul>\n<li>I got a second dog</li>\n<li>Visited US for the first time</li>\n<li>Got married on that first visit</li>\n<li>Left London to move to the Bay area a couple weeks after</li>\n<li>Moved to NYC</li>\n<li>Started boxing regularly</li>\n</ul>\n<p>We are more locked in than ever before.</p>\n<p>Can’t wait for the next 3 years. 🥂</p>",
            "url": "https://didierlopes.com/blog/what-i-learned-in-3-years-at-openb",
            "title": "What I Learned in 3 Years at OpenBB",
            "summary": "The OpenBB journey started officially 3 years ago. So I want to celebrate it by sharing 36 lessons I learned over the past 36 months as a founder and CEO of a fintech company.",
            "date_modified": "2024-08-20T00:00:00.000Z",
            "tags": [
                "career development",
                "technology",
                "OpenBB",
                "learning",
                "leadership"
            ]
        }
    ]
}