{
    "version": "https://jsonfeed.org/version/1",
    "title": "Didier Lopes Blog",
    "home_page_url": "https://didierlopes.com/blog",
    "description": "Didier Lopes Blog",
    "items": [
        {
            "id": "https://didierlopes.com/blog/29-years-old-and-sitting-on-the-top-of-giants",
            "content_html": "<p align=\"center\"><img loading=\"lazy\" width=\"600\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/66448009-209d-498c-aec9-0143692d0596\" class=\"img_ev3q\"></p><p>Yesterday was my 29th birthday, and I was reflecting on my life and on how sitting on the top of giants isn’t given enough credit. My giants are my parents.</p><div style=\"border-top:1px solid #0088CC;margin:1.5em 0\"></div><p>Yesterday I turned 29 years old.</p><p>The night before, I was speaking with my dad about how grateful I am for everything he’s done for my brother and I.  I always had everything - food at the table, a roof and education.</p><p>I’m the person I am today because of my parents.</p><p>But my dad didn’t have it easy.</p><p>And so instead of writing about how grateful I am for the life I have today, I want to share some parts of my dad’s life.</p><p>I don’t like to share personal information about my family, but I feel like from all the posts I read on success - sitting on the top of giants isn’t given enough credit.</p><p>My giants are my parents.</p><p>Here’s his story.</p><p>My dad grew up with very little in a town in the middle of nowhere in Portugal with 6 siblings.</p><p>He did a few years in school and after classes he would come home and watch his parents sheep until it was dark. He did his homework during that time since there was no electricity back then.</p><p>If a sheep ran away while he was doing his homework, his dad would punish him with whatever was at hand, a stick or a belt.</p><p>Times were different back then.</p><p>In school, if he got questions like 7x8 wrong, teachers wouldn’t just say the correct answer. They had a special ruler that was used to hit a student’s hand.</p><p>Again, times were different.</p><p>After a couple of years in school - he didn’t like it (I wonder why eh) and they didn’t have a lot of money. So he started working at the age of 11 in construction.</p><p>An 11 year old kid, taking 2 buckets of cement up and down the stairs to build houses.</p><p>At the age of 17 he moved to Geneva (Switzerland) for a better paid job, as a bricklayer but also did painting jobs and similar.</p><p>At 18, his mum died.  She was run over by a car near our hometown.</p><p>At 20, he had to come to Portugal because of his passport and he met my mum.</p><p>1 year later, my mum moved to Geneva to be with him. She worked in a factory making boxes for Rolex watches.</p><p>At 22, his dad died from a disease.</p><p>He kept working his ass off. 6 days a week, starting at 6 am whether it was snowing, raining or extremely hot.</p><p>No travelling or unnecessary expenses, except tobacco, it was his only addiction as everyone around him smoked - it was a social thing.</p><p>At 24 he got married with my mum. My mum’s family didn’t like his, so they didn’t attend the wedding and they had to cover it with all of their savings.</p><p>At 31, he had me.</p><p>The week before I was born would be the last he would ever smoke, since my mum said that she didn’t want smoke near us because of our health. At some point he was smoking 2 packs a day, and he stopped from one day to the other which is wild.</p><p>At 32 his painting shift had just finished and his boss asked him to give one more painting layer to the outside of an apartment. And he went up the ladder, and it broke. He fell from a 2-story apartment on his foot, and his foot bone got smashed into pieces. (He had actually mentioned to his boss that the ladder didn’t feel very stable earlier that day).\n The doctor told him that he would never be able to do any physical work ever again. 24 years later, and he still struggles to walk for long periods of time.</p><p>At 33, he had my brother.</p><p>Because of the accident, he stayed at home to raise my brother and I.</p><p>A bit after, Portugal joined the Euro. So my dad thought that the living conditions in Portugal would improve overall like other European countries (spoiler alert: it didn’t).</p><p>So, he decided to start building a house on the same land where his hometown house was, in Portugal.</p><p>They couldn’t afford to buy a house in Geneva, but had enough savings that they could build one in his hometown.</p><p>They went back when he was 39 (I was 8), and that’s where I grew up.</p><p>My mum struggled to find a job for many years - she only got a job as a secretary at a furniture store - until they went bankrupt.</p><p>My dad had depression since he was stuck at home with nothing to do.</p><p>Growing up, I wanted to work as a bricklayer in summers to make some cash and my dad forbid me doing so.</p><p>He said that it was dangerous and he didn’t want me to have that life. He has seen a lot of young people dropping out of school because they start receiving salaries early and prioritise short-term outcomes over long-term ones.</p><p>He didn’t want me to follow that path.</p><p>He wanted to give me the opportunities that he didn’t have growing up. And he did.</p><p>One day I got home from high school, and commented that someone I knew always had expensive clothes and watches. He happened to know their family and got upset. He was upset because he knew that they owed a lot of money to a lot of people - and kept living a luxury lifestyle.\n So he told me “You may not wear all of that, but you will never hear in your life that we owe anything to anyone. Everything you have has been bought with a lot of hard work from your mother and I, and not by stealing or owing anything to anyone”.</p><p>I still think about this often, and how appearances are often just that. </p><p>A few years later after I got into university, my parents decided to move back to Switzerland.</p><p>My mum still didn’t have a job and we weren’t going home as much (we both studied relatively far from our hometown). It was hard on her to move away from us, but it was the right thing to do.</p><p>She found a job as a cleaner, which she has been doing for almost 10 years now.</p><p>In the meantime my dad wondered if he could leverage all the skills he had learned growing up to manage a housing project. So he bought land in Portugal, and was heavily involved in the management of the project. Meaning he worked across everything, except the physical aspects of the job.</p><p>It was an investment, but after having so many years in real estate - it was hard for someone to have as much knowledge breadth as he did in terms of costs of materials and staff since he had been on the other side of the coin for a long time. </p><p>Now he does that every now and then, which keeps him busy. But since it involves being far from my mum, this time he’s hiring an agency to be more involved at the expense of less headaches and a lower margin.</p><p>He has a good life now. But he came from nothing, literally.</p><p>Most people on his shoes, don’t make it.</p><p>Damn.</p><p>Most people with more opportunities than him don’t make it.</p><p>I often feel guilty because I get to live life in a way that my parents could never.</p><p>The best way I can think to repay them is to work hard and show them that their hard life will be the last that the future Lopes generation will have to endure.</p><p>That and hopefully buying them a nice car one day.</p>",
            "url": "https://didierlopes.com/blog/29-years-old-and-sitting-on-the-top-of-giants",
            "title": "29 years old and sitting on the top of giants",
            "summary": "Yesterday was my 29th birthday, and I was reflecting on my life and on how sitting on the top of giants isn’t given enough credit. My giants are my parents.",
            "date_modified": "2024-06-05T00:00:00.000Z",
            "tags": [
                "birthday",
                "dad",
                "family"
            ]
        },
        {
            "id": "https://didierlopes.com/blog/rabbit-r1-there-is-hope",
            "content_html": "<p align=\"center\"><img loading=\"lazy\" width=\"600\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/8c4c9b26-62d9-46cf-8758-28c822d3fd2e\" class=\"img_ev3q\"></p><p>I can see a future where people use rabbit r1 for very particular use cases where phone is suboptimal. For instance, when multiple people want to interact with said phone (e.g. selecting music at a party without having to give phone away) and that is not ideal due to personal information on phone, or when the phone isn't ideal because it has too many distractions and user wants to focus on doing something (e.g. practicing a presentation using recording session and then asking for feedback).</p><div style=\"border-top:1px solid #0088CC;margin:1.5em 0\"></div><h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"what-is-the-rabbit-r1\">What is the rabbit r1<a href=\"#what-is-the-rabbit-r1\" class=\"hash-link\" aria-label=\"Direct link to What is the rabbit r1\" title=\"Direct link to What is the rabbit r1\">​</a></h2><p>Rabbit r1 was first introduced at CES 2024 as a pocket AI companion (watch the keynote <a href=\"https://www.rabbit.tech/rabbit-r1\" target=\"_blank\" rel=\"noopener noreferrer\">here</a>).</p><p align=\"center\"><img loading=\"lazy\" width=\"600\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/3afa54da-ecf9-4767-a264-2e1027e83497\" class=\"img_ev3q\"></p><p>The main distinction over being just a \"ChatGPT on-the-go\" is the fact that they introduced what they call a Large Action Model (LAM), which is an agent capable of taking requests and making different function calls (e.g., translation, weather, finance, vision, taking notes, and more).</p><p>There are now quite a few consumer products that are trying to win this category. Here are a few:</p><ul><li><p><a href=\"https://humane.com/\" target=\"_blank\" rel=\"noopener noreferrer\">AI pin</a> from Humane. MKBHD did a good <a href=\"https://www.youtube.com/watch?v=TitZV6k8zfA\" target=\"_blank\" rel=\"noopener noreferrer\">review</a> on this product (or should I say 'bad review'?).</p></li><li><p><a href=\"https://www.limitless.ai/\" target=\"_blank\" rel=\"noopener noreferrer\">pendant</a> from Limitless (previously Rewind AI).</p></li><li><p><a href=\"https://www.openinterpreter.com/\" target=\"_blank\" rel=\"noopener noreferrer\">01</a> from Open Interpreter. I ordered this one because it's <a href=\"https://github.com/OpenInterpreter/open-interpreter\" target=\"_blank\" rel=\"noopener noreferrer\">open source</a> and I can build on top.</p></li></ul><p>While at the surface these devices are somewhat similar, they approach the problem from a different angle. AI pin relies on users to clip their device to their clothes, the pendant is put on the collar of your top and 01 is held handheld. Rabbit r1 is also handheld, but unlike the others contains a screen to interact with - so it's closer to a phone than the others.</p><p>Nonetheless, according to Jesse (rabbit's CEO) they are currently the most successful AI device in terms of sales (sold over 100,000 rabbit r1 in a few weeks).</p><h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"how-i-got-my-r1\">How I got my r1<a href=\"#how-i-got-my-r1\" class=\"hash-link\" aria-label=\"Direct link to How I got my r1\" title=\"Direct link to How I got my r1\">​</a></h2><p>My wife saw me watching a few videos of rabbit r1 and decided to surprise me with one, a one-time $199 purchase without any subscription fee. I wonder why she didn’t do it when I was watching Apple Vision Pro 😄.</p><p>But they didn’t ship immediately. My batch was only meant to be shipped sometime in June. However, rabbit tweeted that there would be a Pickup Party in NYC. I added notifications on their X account and once they announced that registrations were open I was ready. I RSVPd and this week I attended the event to grab mine.</p><p>The event was well organized. One thing is for sure, rabbit knows how to build a community and hype with their users.</p><p align=\"center\"><img loading=\"lazy\" width=\"600\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/2f1e4169-437c-46a9-b7b0-0bf46346e9be\" class=\"img_ev3q\"></p><p>The keynote presented at the event can be found <a href=\"https://www.rabbit.tech/live-unboxing\" target=\"_blank\" rel=\"noopener noreferrer\">here</a>. In it, rabbit's CEO unboxes a rabbit r1 and shows everything it can do on stage.</p><h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"my-experience\">My experience<a href=\"#my-experience\" class=\"hash-link\" aria-label=\"Direct link to My experience\" title=\"Direct link to My experience\">​</a></h2><p>I have been playing with rabbit r1 for a couple of days now. A few funny things I've done since:</p><ul><li><p>Jailbreak rabbit r1 to say <a href=\"https://x.com/didier_lopes/status/1783335809459859708\" target=\"_blank\" rel=\"noopener noreferrer\">f*ck which falls outside the guidelines</a></p></li><li><p>Ask it what LLM it was using under the hood, to which it said <a href=\"https://x.com/didier_lopes/status/1783346493832753477\" target=\"_blank\" rel=\"noopener noreferrer\">it was using a fine-tuned version of OpenAI's GPT-3</a></p></li><li><p>Have rabbit r1 make a <a href=\"https://x.com/didier_lopes/status/1784228313717776505\" target=\"_blank\" rel=\"noopener noreferrer\">Deez Nuts joke</a></p></li><li><p>Use rabbit r1 as a <a href=\"https://x.com/didier_lopes/status/1784357946920505387\" target=\"_blank\" rel=\"noopener noreferrer\">Not Hotdog app</a> (<a href=\"https://www.imdb.com/title/tt2575988/\" target=\"_blank\" rel=\"noopener noreferrer\">Silicon Valley reference</a>)</p></li></ul><p>But now onto the serious stuff. Since I was at the Pickup Party where Jesse split the presentation based on the major features of the products, I want to address each of these individually after having time to play with them.</p><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"search\">Search<a href=\"#search\" class=\"hash-link\" aria-label=\"Direct link to Search\" title=\"Direct link to Search\">​</a></h3><p>For search, rabbit r1 relies on <a href=\"https://www.perplexity.ai/\" target=\"_blank\" rel=\"noopener noreferrer\">Perplexity</a>. I'm a Perplexity fan myself and at some point I even replaced my default <a href=\"https://arc.net/\" target=\"_blank\" rel=\"noopener noreferrer\">Arc browser</a> search engine with Perplexity. This only lasted one day because then I realized how many times I just wanted to end up on a landing page or on someone's LinkedIn/X. It made me realize why Google is, well, Google. Regardless, this is something that I do with my phone, and so I don't think it's a strong use case.</p><p>However, if you have a kid that is curious to understand the world. I think a rabbit r1 is well worth it to use it to ask questions that they are curious about, without having the distractions that a phone provides.</p><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"vision\">Vision<a href=\"#vision\" class=\"hash-link\" aria-label=\"Direct link to Vision\" title=\"Direct link to Vision\">​</a></h3><p><strong>What is this</strong> - I just don't think this is a strong use case overall. This is not something that you do daily, weekly, or even monthly. Maybe once a year or so. The last time I did it was last year in Mexico to know the name of an animal that was nearby. I went to Google and looked for \"Mexico animal that looks like a racoon\" and the first answer was Coati which was what I was looking for. If that query didn't work, I would have taken a picture of the animal and then Google search - but that's my second choice because of the effort of doing so. This to say that it's not really a pain point that users will have.</p><p><strong>Edit spreadsheet</strong> - This is a somewhat interesting use case choice, I wonder if they picked it up because no other device showed being capable of doing this (taking a picture to a handwritten table, asking for a change and emailing the image to your email). Personally, I don't write tables that much anymore on paper, and the ones I do are small enough that if I want to transcribe it takes me seconds to do. It may be a strong use case for certain jobs, but I’m not sure about it, nor the performance it would have on large tables. The example Jesse shared at the event was a 5x3 tabl.</p><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"terminal-mode\">Terminal mode<a href=\"#terminal-mode\" class=\"hash-link\" aria-label=\"Direct link to Terminal mode\" title=\"Direct link to Terminal mode\">​</a></h3><p>It’s like using ChatGPT but with a worse interface. The keyboard reminds me of BlackBerry but it’s gimmicky to use - personally, I didn’t like the experience. I would always pick up my phone to use ChatGPT over using the Terminal mode for instance.</p><p align=\"center\"><img loading=\"lazy\" width=\"600\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/8035e678-e81d-4d71-b1ad-5bfcdbd57ffd\" class=\"img_ev3q\"></p><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"translation\">Translation<a href=\"#translation\" class=\"hash-link\" aria-label=\"Direct link to Translation\" title=\"Direct link to Translation\">​</a></h3><p>YES. Having Portuguese parents that don’t speak english, whenever they are with my wife, I need to be the translator. So having a device that allows them to translate in “real-time” both ways is a huge value add.</p><p>Yes, I know that Google already has this feature - but it's shit and if you disagree, you never actually used it. LLMs can understand expression and meaning, in a way that a model like BERT cannot. I actually did this post where I prompted ChatGPT to do exactly this - act as a device that stays in the middle of a conversation translating from one language to another based on who the speaker was (tweet <a href=\"https://x.com/didier_lopes/status/1740049615804846461\" target=\"_blank\" rel=\"noopener noreferrer\">here</a>, it went kind of viral).</p><p>Sure, this could be an app, but I quite like the idea of having a device that just does this. I think that’s because the translation works both ways, so I imagine you passing the device to the other person to press the button when they want to speak. So that way, it feels more like a “common” object whereas your phone is more personal.</p><p>Although I was excited about this, and it was the first thing I tried it failed badly. The CTO of the company <a href=\"https://x.com/LiaoPeiyuan/status/1783001793573843078\" target=\"_blank\" rel=\"noopener noreferrer\">replied</a> to <a href=\"https://x.com/didier_lopes/status/1783000272278569412\" target=\"_blank\" rel=\"noopener noreferrer\">my tweet</a> saying that they are working on fixing it.</p><p align=\"center\"><img loading=\"lazy\" width=\"600\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/ad21e88a-6c24-4a90-b390-24f13c7e505a\" class=\"img_ev3q\"></p><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"notes\">Notes<a href=\"#notes\" class=\"hash-link\" aria-label=\"Direct link to Notes\" title=\"Direct link to Notes\">​</a></h3><p>Yay, another note-taking app. NOT. I’d prefer an integration with the Apple Notes app or Notion, so I don’t need to then go into yet another website and copy-paste those notes to some other place.</p><p align=\"center\"><img loading=\"lazy\" width=\"600\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/bac0a02c-d252-4f37-a768-ca7f74a6e30e\" class=\"img_ev3q\"></p><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"voice-recording\">Voice Recording<a href=\"#voice-recording\" class=\"hash-link\" aria-label=\"Direct link to Voice Recording\" title=\"Direct link to Voice Recording\">​</a></h3><p>The voice recording feature is pretty good. If you are a content creator (e.g., writer, youtuber), I think this is very powerful. The way I see it is that rabbit offers way less distractions than your phone, so you could go on a walk and take r1 and just speak with it to brainstorm ideas. Then go to the website and analyze your ideas to transform it into content.</p><p>Personally, when I have ideas like this I just drop a voice note to my wife’s WhatsApp and then mark the message as unread. It’s hacky but it works and I've been doing it for a long time now. We have an inside joke where I start these audios with “Note to self” and she always makes fun of it.</p><div class=\"flex justify-center gap-2\"><img loading=\"lazy\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/ba21850b-dfff-4bf5-a018-722a9d68f9b2\" width=\"50%\" class=\"img_ev3q\"><img loading=\"lazy\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/a98d6538-9a98-49a0-802a-8e5a6ce6edd1\" width=\"50%\" class=\"img_ev3q\"></div><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"music\">Music<a href=\"#music\" class=\"hash-link\" aria-label=\"Direct link to Music\" title=\"Direct link to Music\">​</a></h3><p>Last year for my birthday my wife gave me a <a href=\"https://divoom.com/products/divoom-pro\" target=\"_blank\" rel=\"noopener noreferrer\">Divoom Ditoo-Pro Retro</a> - it does a lot of things (e.g. music, radio, alarm, voice memo, games, music, planner, pixel art). Honestly, I just use it for music. It lived in my car during the entire year as a speaker since I didn't have bluetooth audio in the car. I think the advantage of rabbit r1 over it is that I can use my voice to change the music, which is handy if you are driving. On the other hand, my Divoom allows me to listen to my audibles since it acts as a bluetooth speaker whereas rabbit r1 would need an audible integration.</p><p>I think this can be a compelling use case as sitting in the middle of the table at a dinner or party with friends, where if someone wants to change the music they can just use the rabbit r1 to ask for something - and this way you can keep your phone/laptop on you instead of using it for everybody else to touch.</p><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"apps\">Apps<a href=\"#apps\" class=\"hash-link\" aria-label=\"Direct link to Apps\" title=\"Direct link to Apps\">​</a></h3><p><strong>Doordash/Uber</strong> - I haven’t tried it yet, but I feel like the phone is so good at it already and with a rich UI/UX, that I don’t see the point in using rabbit r1.</p><p><strong>Generative AI</strong> - This is an interesting use case. Personally I don’t use Midjourney so I'm not the target audience. I do find it interesting that you can generate these images on the go on r1 directly without having to go through Discord (suboptimal) experience. I'm excited about the opportunities that this presents - for instance, integrating with <a href=\"https://openbb.co/products/bot\" target=\"_blank\" rel=\"noopener noreferrer\">OpenBB Bot</a> to display financial data on rabbit r1 directly.</p><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"teach-mode\">Teach mode<a href=\"#teach-mode\" class=\"hash-link\" aria-label=\"Direct link to Teach mode\" title=\"Direct link to Teach mode\">​</a></h3><p>Jesse showed a brief preview of how teach mode works but mentioned that this feature is not yet available and they want to nail the user experience and add guardrails so users cannot use it for something malicious. I'm very excited about the teach mode prospect, since I think this falls in the category of \"app creation\" and allows users to use the device for very specific needs, hence opening the total addressable market.</p><h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"conclusion\">Conclusion<a href=\"#conclusion\" class=\"hash-link\" aria-label=\"Direct link to Conclusion\" title=\"Direct link to Conclusion\">​</a></h2><p>First of all, the rabbit r1 is beautiful. It's light, well made and has this bright appealing color. This isn't surprising since it was done in collaboration with <a href=\"https://teenage.engineering/\" target=\"_blank\" rel=\"noopener noreferrer\">Teenage Engineering</a> (a company known for making products that I want without knowing what they do).</p><p>This may be controversial, but the thing I like the least about the hardware is the button being located on the right side. The reason why I hate that decision is that I cannot easily use the device with one hand only. If I try, it becomes very gimmicky where I do gymnastics just to press the button. I don't get why they didn't make it right under the scrolling wheel, it would resemble more a controller/phone which is something that our hands have long been accustomed to. Even if the button was located on the upper side of the device, the UX would be MUCH better. </p><p>That's one of my biggest complaints against the hardware itself, see image below to see what I mean. I almost need to bend my right thumb in order to reach the button which is used very often. One can argue that I can wrap my hands more around the device to give a better experiencing in clicking the button which is 100% true, HOWEVER, if I do that then I can't reach the wheel to scroll.</p><div class=\"flex justify-center gap-2\"><img loading=\"lazy\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/2cf09c92-8607-4506-b722-0e15993b30f9\" width=\"50%\" class=\"img_ev3q\"><img loading=\"lazy\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/761f8013-1d62-4da0-8db6-b93b1efae431\" width=\"50%\" class=\"img_ev3q\"></div><br><p>Also, related with the picture from the above. The battery is pretty weak, it needs to be charged often.</p><p>The rabbit r1 OS has a lot of room for improvement, a few things I've experienced:</p><ul><li>Having a black screen that doesn't recover until I manually power off device;</li><li>Not triggering the function I want - sometimes it looks for a specific wording, e.g. \"start a recording session\" works but \"do a voice recording\" does not. I would have expected for it to be able to understand intent;</li><li>Sometimes I get a \"The app is under maintenance. Please try again later\" for functions that I know it is capable of doing;</li><li>Every few minutes getting \"unable to connect to Rabbit OS\";</li><li>Randomly losing the previous context - I assume this is because of the number of tokens that can fit in the context?;</li><li>Spotify integration broken;</li><li>Even though it knows my location (due to getting weather app location correct), the time is not correct and I can't update it through the settings.</li></ul><p>But this is also the first product version and LLMs are by nature non-deterministic so these type of bugs are kind of expected.</p><p>It's a one-time $199 price tag. There's no recurring subscription. As a consumer, I like this a lot. A one-time purchase allows users to buy the product to experiment without any strong commitment (apart from that one-time fee of course). In terms of economics, I'm not sure how Rabbit will handle a growing user base and better LLMs. During the event, they mentioned a partnership with both OpenAI and Anthropic. If they are using one of these models, someone needs to be paying for these tokens. For instance, for <a href=\"https://openbb.co/products/pro\" target=\"_blank\" rel=\"noopener noreferrer\">OpenBB Terminal Pro</a> we decided to allow usage similarly to how the ChatGPT free tier works, which basically rate limits based on usage and allows us to keep our costs controlled.</p><p>Meta is attempting to commoditize LLMs, so if I were in rabbit's shoes I would consider hosting <a href=\"https://llama.meta.com/llama3/\" target=\"_blank\" rel=\"noopener noreferrer\">Llama 3</a> locally and providing inference from this directly. Maybe even do a partnership with <a href=\"https://groq.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Groq</a> for users paying a small subscription - not so much because of the impressive 800 tokens/s inference (using Llama 3) since rabbit r1 uses voice and inference speed is less relevant, but for the cold start (i.e. the lag between user question and output). Meta's commercial license only applies to companies with over 700 Million active users, so I think Rabbit would be good for some time.</p><p>Personally, I wouldn’t recommend rabbit r1 as a phone alternative. Not even close. If someone says that they stopped using their phone after having their rabbit r1, I can guarantee you that they weren’t using their phone a lot anyway. I agree a lot with MKBHD in saying <a href=\"https://www.youtube.com/watch?v=TitZV6k8zfA\" target=\"_blank\" rel=\"noopener noreferrer\">Phones are OP</a>.</p><p>But if you are reading this, you are probably wondering what are the use cases where I would recommend Rabbit r1. So let's do that.</p><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"this-is-a-buy-if\">This is a buy if<a href=\"#this-is-a-buy-if\" class=\"hash-link\" aria-label=\"Direct link to This is a buy if\" title=\"Direct link to This is a buy if\">​</a></h3><ul><li><p>For kids that are curious and want to learn more about the world. Being able to have it before a phone, is very compelling. Imagine your kid being able to ask r1 what a word means and how to use it in a sentence, who person X is, how something works, to practice learning another language, as a complement when reading a book/studying. The advantage over the phone is that it doesn't have any other distractions. It would basically be Perplexity on the go, and thus the Perplexity tagline \"Where knowledge begins\" makes total sense.</p></li><li><p>As a device for two-way translation. The two-way is important, because if it’s just one-way then using the phone is preferred. But being two-way allows for both people to interact with the device, which in my opinion is less personal than a phone and more like a gadget. We aren't there yet, but I'm sure the model will keep improving and becoming better at this.</p></li><li><p>For content creators who want to “zone out” and leave their phone at home and just use the record feature to record content, whether that is a blog post, a new lyrics or a podcast idea. </p></li><li><p>As a music device to be at the center of a table at a dinner, in the corner at a party selecting the tunes or on a roadtrip. People will enjoy interacting with it due to its unique nature, and that way you don't need to be blocked from using your phone.</p></li><li><p>As a virtual assistant. If the alarm feature was already implemented, I would've likely already replace my Alexa, since rabbit r1 looks much nicer. Even more with the cool standing case.</p></li></ul><p>... and of course, the use case is worth $200 for you. There are likely devices that can achieve the same for a cheaper cost. I like the fact that is state-of-the-art and they are trying to innovate.</p><p>Also, the rabbit effect going up and down waiting to be prompted and the hears going up when listening is pretty sweet - see it <a href=\"https://github.com/DidierRLopes/my-website/assets/25267873/9cb1ab73-eba6-481b-a4ad-dee228c8ea58\" target=\"_blank\" rel=\"noopener noreferrer\">here</a>.</p><p>In any case, there are two recurring topics in these use cases, so let's talk about each individually.</p><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"main-use-cases\">Main use cases<a href=\"#main-use-cases\" class=\"hash-link\" aria-label=\"Direct link to Main use cases\" title=\"Direct link to Main use cases\">​</a></h3><ol><li><p><strong>A very targeted use case</strong> - The phone can be a double-edged sword. On the one hand, it's your door to the world and what's happening. On the other hand, it's your door to the world and what's happening. I say it this way because this can be extremely good or bad depending on the use case. Phones are optimized for users to spend time on them, apps are optimized to provide dopamine hits so users use them for longer. Notifications will interrupt you throughout the day so you remember to go back to the app, etc.. But sometimes you only want to do 1 thing, and don't want to be distracted from it. The best example are E-Books. You can read on your phone, iPad or laptop - yet people decide to buy a kindle so they can just do that. Read with no distractions. You are paying a premium for a product to remove the distractions. I believe that rabbit r1 can achieve this, particularly if they allow developers to build specific apps for specific use cases.</p></li><li><p><strong>Gadget to be used by multiple people</strong> (examples above: two-way translation or music device) - The phone has become a very personal device over the years. If someone gets access to your phone unlocked they have access to who you are (important emails, personal photos, chat conversations, the apps you use and how do you spend your time, the songs you listen or books you read, even confidential documents). So, there are certain scenarios where you don't want to borrow your phone to someone to do something, since that requires trust that they won't see anything that is confidential. I think Rabbit r1 can go after this category because its a shiny gadget that doesn't really hold any personal information from the user, and this way allows the user to keep their phone in their pocket while using rabbit r1 for some tasks that the phone could also do but would require for others to have access to it.</p></li></ol><br><p align=\"center\"><img loading=\"lazy\" width=\"600\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/fb909082-d919-428e-b059-f641d6eff167\" class=\"img_ev3q\"></p><h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"excited-about\">Excited about<a href=\"#excited-about\" class=\"hash-link\" aria-label=\"Direct link to Excited about\" title=\"Direct link to Excited about\">​</a></h2><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"developer-ecosystem\">Developer Ecosystem<a href=\"#developer-ecosystem\" class=\"hash-link\" aria-label=\"Direct link to Developer Ecosystem\" title=\"Direct link to Developer Ecosystem\">​</a></h3><p>Apple became Apple not because of their revolutionary LCD screen without a keyboard, but because of the developer ecosystem they created. The iPhone became stickier over time, because there were more apps being built on top of it that users could easily tap into. It also allowed Apple to generate revenue from the monetization of these apps.</p><p>I truly hope that this is the direction that Jesse and team want to take. If I were in their shoes, I would prioritize that over any other feature. Just allow developers to create apps (in this case functions) that the LAM can call to do something very specific.</p><p>Instead of having their team working on all these features, create the foundational marketplace that allows developers to do so. Start by only allowing free apps and see what developers are building and what users are utilizing. Then move to allow developers to monetize and take a cut from it. And allow users to decide what apps are enabled within their devices and which ones aren't - show which apps are the most downloaded and used and link it to a user profile. Make it so that the user profile needs to be a rabbit r1 holder to avoid scams..</p><p>A few examples: Someone building a Pokedex app for animals, you take r1 to the zoo and just take a picture of the animals with it, then you go home and look into your pokedex. Or a Pokedex for travel monuments. Or integrating OpenBB so I could do research on-the-go.</p><p align=\"center\"><img loading=\"lazy\" width=\"600\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/087e2c61-d7fa-4e9c-a529-897a64f14e06\" class=\"img_ev3q\"></p><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"native-ai-phone\">Native AI-phone<a href=\"#native-ai-phone\" class=\"hash-link\" aria-label=\"Direct link to Native AI-phone\" title=\"Direct link to Native AI-phone\">​</a></h3><p><a href=\"https://us.nothing.tech/\" target=\"_blank\" rel=\"noopener noreferrer\">Nothing</a> has one of the best consumer tech brands out there. If the Apple ecosystem wasn't as sticky as it is today, I would buy one. Both Nothing and Rabbit are very unique brands, and I think a partnership between them could be a game-changer.</p><p>I'm imagining a Native AI-phone built on Android with rabbit's LAM. So, in simple terms, it would be like Nothing Phone (2) but it would have an r1 button that you can use to interact with it through voice instead of fingers. The challenge would be combining the LAM from rabbit r1 to all the apps that Nothing Phone (2) provides - but I believe in a future where applications will be built not only thinking about how humans will utilize them but also LLMs - at least <a href=\"https://github.com/OpenBB-finance/openbb-agents\" target=\"_blank\" rel=\"noopener noreferrer\">we are doing that at OpenBB</a> with the <a href=\"https://github.com/OpenBB-finance/OpenBBTerminal\" target=\"_blank\" rel=\"noopener noreferrer\">OpenBB Platform</a>.</p>",
            "url": "https://didierlopes.com/blog/rabbit-r1-there-is-hope",
            "title": "rabbit r1, there is hope",
            "summary": "I can see a future where people use rabbit r1 for very particular use cases where phone is suboptimal. For instance, when multiple people want to interact with said phone (e.g. selecting music at a party without having to give phone away) and that is not ideal due to personal information on phone, or when the phone isn't ideal because it has too many distractions and user wants to focus on doing something (e.g. practicing a presentation using recording session and then asking for feedback).",
            "date_modified": "2024-04-28T00:00:00.000Z",
            "tags": [
                "rabbit r1",
                "tech",
                "review",
                "ai",
                "gadget"
            ]
        },
        {
            "id": "https://didierlopes.com/blog/goh-analyst-the-ai-powered-financial-analyst-who-lives-on-slack",
            "content_html": "<p align=\"center\"><img loading=\"lazy\" width=\"600\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/5a931097-9dc7-4b7b-baa5-d8c4f52a8705\" class=\"img_ev3q\"></p><p>How I built a financial analyst that lives on Slack and has access to OpenBB.</p><p>The open source code is available <a href=\"https://github.com/DidierRLopes/openbb-slack-agent\" target=\"_blank\" rel=\"noopener noreferrer\">here</a>.</p><div style=\"border-top:1px solid #0088CC;margin:1.5em 0\"></div><h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"context\">Context<a href=\"#context\" class=\"hash-link\" aria-label=\"Direct link to Context\" title=\"Direct link to Context\">​</a></h2><p>At OpenBB, we have the tradition of hosting an internal Creaton on the penultimate week of the year.</p><p>The OpenBB Creaton is our creative Hackathon, where every team member picks a project to work on throughout the week and gets fully focused on it. The only rule is that it relies on OpenBB technology.</p><p>It’s a way for us to get further contact with our technology, but it also allows us to create proofs-of-concept of products/features that we may invest in the feature. Think of it as an R&amp;D week.</p><p>We do it then because our team members get the last week of the year as time off. So, if they want to present their project to the rest of the team in January, they can also use that time to wrap up.</p><h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"my-project\">My Project<a href=\"#my-project\" class=\"hash-link\" aria-label=\"Direct link to My Project\" title=\"Direct link to My Project\">​</a></h2><p>At the Open Core Summit III, I presented a way of creating an AI-powered financial analyst capable of handling complex financial queries.</p><p>I wrote more about this in this <a href=\"/blog/creating-an-ai-powered-financial-analyst\">blog post</a>. This robust architecture can access 100+ financial datasets from OpenBB tools and reason about them. The code is open source here.</p><p>I shared how our AI-powered financial analyst was able to answer</p><blockquote><p>“Check what TSLA peers are. From those, check which one has the highest market cap. Then, for the ticker that has the highest market cap, get the most recent price target estimate from an analyst, and tell me who it was and on what date the estimate was made.”</p></blockquote><br><p>and</p><blockquote><p>“Perform a fundamentals financial analysis of AMZN using the most recently available data. What do you find that’s interesting?”</p></blockquote><br><p>Since that was already working so well (watch the <a href=\"https://www.youtube.com/watch?v=A-43EKK2PhE&amp;embeds_referring_euri=https://openbb.co/blog/creating-an-ai-powered-financial-analyst&amp;source_ve_path=MjM4NTE\" target=\"_blank\" rel=\"noopener noreferrer\">presentation video here</a>), I wanted to bring these capabilities to Slack, show that this could be the future, and prove it would impact every analyst job.</p><p>That’s when Goh Analyst was born.</p><p align=\"center\"><img loading=\"lazy\" width=\"800\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/3460df7d-0860-4761-9f99-686afca1d78c\" class=\"img_ev3q\"></p><p>Note: Goh Analyst together is GOHANalyst, which is why the image is Gohan from Dragon Ball with the OpenBB logo on his forehead.</p><h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"how-does-it-work\">How does it work?<a href=\"#how-does-it-work\" class=\"hash-link\" aria-label=\"Direct link to How does it work?\" title=\"Direct link to How does it work?\">​</a></h2><p>To get started, you can see the <a href=\"https://github.com/DidierRLopes/openbb-slack-agent/tree/main\" target=\"_blank\" rel=\"noopener noreferrer\">open-source repository and instructions</a>.</p><p>First, I forked the <a href=\"https://github.com/OpenBB-finance/openbb-agents\" target=\"_blank\" rel=\"noopener noreferrer\">open-source code of the OpenBB agents repository</a> that we have been using for R&amp;D. This repository contains all the code for the OpenBB agent and has access to 100+ financial datasets.</p><p>Then, I modified it to my needs:</p><p>Created the Slack bot interface</p><p>When a Slack message mentions @Gohanalyst this workflow gets triggered</p><p>When the Slack message contains the word “OpenBB”, I send that message through the OpenBB agent since the assumption is that data retrieval will be necessary. Otherwise, it goes straight through OpenAI.</p><p>In a nutshell, this is what the architecture looks like:</p><p align=\"center\"><img loading=\"lazy\" width=\"800\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/6ed47ea6-47b8-4253-97cd-d29b076c7c73\" class=\"img_ev3q\"></p><p>I made Goh Analyst slightly sarcastic to make it a bit more fun. This makes interacting in a public channel somewhat more human and exciting. It can handle simple financial questions, retrieve data using OpenBB tools, or even answer more complex reasoning questions.</p><p align=\"center\"><img loading=\"lazy\" width=\"800\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/6ad2d3e6-2472-4b33-a29c-7fc30e84f49c\" class=\"img_ev3q\"></p><p align=\"center\"><img loading=\"lazy\" width=\"800\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/7101b979-63dd-4363-995c-1dd9704513ca\" class=\"img_ev3q\"></p><p>Now imagine that every organization has an analyst on their Slack to help make decisions.</p><h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"whats-next\">What's next<a href=\"#whats-next\" class=\"hash-link\" aria-label=\"Direct link to What's next\" title=\"Direct link to What's next\">​</a></h2><p>As I mentioned earlier, one of the advantages we get from OpenBB Creaton is that we test our products and give feedback to the team on what went well or less well. After working on this project, this is what I shared with the team:</p><p align=\"center\"><img loading=\"lazy\" width=\"800\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/11d24983-0863-4232-a4d7-e9912837eee3\" class=\"img_ev3q\"></p><p>Exciting times we live in. If you want to leverage AI within your financial firm, we can help you 🤝</p>",
            "url": "https://didierlopes.com/blog/goh-analyst-the-ai-powered-financial-analyst-who-lives-on-slack",
            "title": "Goh Analyst - The AI-powered financial analyst who lives on Slack",
            "summary": "How I built a financial analyst that lives on Slack and has access to OpenBB.",
            "date_modified": "2024-03-26T00:00:00.000Z",
            "tags": [
                "learning",
                "experience",
                "growth",
                "moving",
                "london",
                "bay",
                "US",
                "travel",
                "startup",
                "nyc"
            ]
        },
        {
            "id": "https://didierlopes.com/blog/moving-countries-and-starting-a-company-aint-so-different",
            "content_html": "<p align=\"center\"><img loading=\"lazy\" width=\"600\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/42e21efe-0555-498c-80d8-039c886d380b\" class=\"img_ev3q\"></p><p>I have started a company. I have moved countries. It turns out that there's a lot in common between these.</p><br><div style=\"border-top:1px solid #0088CC;margin:1.5em 0\"></div><p>Recently, I wrote a blogpost about the <a href=\"/blog/moving-from-london-to-the-bay-area-and-what-changed\">difference in culture between London and San Francisco</a>. I convinced my wife and dogs, packed our bags, and didn't look back. After all, I would live in the city with the highest density of builders per capita.</p><p><strong>But why?</strong></p><p>Most of my friends and family didn't understand why I would leave London. I liked the city, I enjoyed my lifestyle, I had friends, I played football with the same group every week, had dinner at the same restaurants, was close to family, and wouldn't be able to save money.</p><p>Logically speaking, this move didn't make any sense. No one really told me that I was doing the right thing, but internally, I knew I had to.</p><p>I believe this isn't so different from creating a startup. This blog post will explain what they have in common and why I did it.</p><h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"creating-a-startup--deciding-to-leave-yourcountry\">Creating a startup / Deciding to leave your&nbsp;country<a href=\"#creating-a-startup--deciding-to-leave-yourcountry\" class=\"hash-link\" aria-label=\"Direct link to Creating a startup / Deciding to leave your&nbsp;country\" title=\"Direct link to Creating a startup / Deciding to leave your&nbsp;country\">​</a></h2><p><a href=\"http://eladgil.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Elad Gil</a> wrote a really good <a href=\"https://blog.eladgil.com/p/startups-are-an-act-of-desperation\" target=\"_blank\" rel=\"noopener noreferrer\">article</a> on how creating a startup is an act of desperation. I believe that post could be equally applicable to moving countries, so I will list the same points used by Elad in the context of moving countries and provide examples. Most of the time, the person moving countries has a mix of the below bullet points.</p><blockquote><p><strong>Career desperation.</strong> Startups allow people early or stuck in their careers to jump a few steps ahead.</p></blockquote><br><p>This applies equally to moving, and is why I left Portugal to pursue an MSc at Imperial College London.</p><blockquote><p><strong>Financial desperation.</strong> If successful, a startup will also leapfrog you financially.</p></blockquote><br><p>This is the biggest motivation for people to move countries. This is why I was born in Switzerland, even though my parents are Portuguese. Having blue-collar jobs, they emigrated to a country with a better economy to provide my brother and me with a better life.</p><blockquote><p><strong>Product or mission desperation.</strong> The other reason startups often exist is that the founders are desperate for a product to exist in the world.</p></blockquote><br><p>In this case, it's the equivalent of hearing about Silicon Valley in documentaries or watching Steve Jobs presenting the iPhone in 2007. You cannot ignore that as an engineer, so you are desperate to move to be part of that tech scene.</p><blockquote><p><strong>Desperation to do something big or important, and to avoid wasted time.</strong> Some people want to \"make a dent in the universe\" and are motivated by doing something useful with their lives.</p></blockquote><br><p>This is what the \"American dream\" is all about. People moved to the US to do something bigger than themselves and achieve the promised dream.</p><blockquote><p><strong>Revenge vs the Arena</strong></p></blockquote><br><p>The equivalent to this is when someone returns to their home country after several years outside with more wealth and/or experience.</p><h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"growing-a-startup--livingabroad\">Growing a startup / Living&nbsp;abroad<a href=\"#growing-a-startup--livingabroad\" class=\"hash-link\" aria-label=\"Direct link to Growing a startup / Living&nbsp;abroad\" title=\"Direct link to Growing a startup / Living&nbsp;abroad\">​</a></h2><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"mission-andvision\">Mission and&nbsp;Vision<a href=\"#mission-andvision\" class=\"hash-link\" aria-label=\"Direct link to Mission and&nbsp;Vision\" title=\"Direct link to Mission and&nbsp;Vision\">​</a></h3><p>When creating a company, you must have a clear mission and vision. This allows you to create a community/team that will be with you for the long run. Similarly, when moving countries, it's essential to have a well-defined goal. This doesn't mean that the goal cannot change; after all, companies pivot. However, you need to have a strategy that you follow until you don't.</p><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"risk-and-uncertainty\">Risk and Uncertainty<a href=\"#risk-and-uncertainty\" class=\"hash-link\" aria-label=\"Direct link to Risk and Uncertainty\" title=\"Direct link to Risk and Uncertainty\">​</a></h3><p>Startups and moving to a new country both involve stepping into the unknown. Entrepreneurs often take financial and personal risks, while those moving countries leave behind familiar surroundings, support systems, and sometimes even their careers. Uncertainty becomes a constant companion, demanding adaptability, problem-solving skills, and the ability to embrace change with open arms.</p><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"cultural-integration-and-networking\">Cultural Integration and Networking<a href=\"#cultural-integration-and-networking\" class=\"hash-link\" aria-label=\"Direct link to Cultural Integration and Networking\" title=\"Direct link to Cultural Integration and Networking\">​</a></h3><p>Building a successful startup requires networking, forming strategic partnerships, and understanding the market. Similarly, when moving countries, one must navigate cultural differences, learn new languages, and establish a network of contacts. Expanding social circles, building relationships, and immersing oneself in the local culture contribute to personal growth and enhance professional opportunities, just like in the startup world.</p><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"resilience-and-persistence\">Resilience and Persistence<a href=\"#resilience-and-persistence\" class=\"hash-link\" aria-label=\"Direct link to Resilience and Persistence\" title=\"Direct link to Resilience and Persistence\">​</a></h3><p>Building a startup and moving countries demands unwavering resilience and persistence in facing challenges. Startups encounter setbacks, pivots, and failures, but successful entrepreneurs persist and learn from their experiences. Similarly, moving countries can bring unexpected hurdles, such as language barriers, difficulties making friends, challenges adapting to a new culture, or not finding a routine. Embracing these challenges with determination and adaptability paves the way for growth and achievement.</p><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"learning-andgrowth\">Learning and&nbsp;Growth<a href=\"#learning-andgrowth\" class=\"hash-link\" aria-label=\"Direct link to Learning and&nbsp;Growth\" title=\"Direct link to Learning and&nbsp;Growth\">​</a></h3><p>Startups and moving countries are transformative experiences that offer immense personal and professional growth opportunities. Entrepreneurs continuously learn from their successes and failures in the startup world, refining their strategies and acquiring new skills. Likewise, moving countries provides a unique chance to learn about different cultures, broaden perspectives, and develop resilience, patience, and empathy. Both experiences foster personal development and shape individuals into more well-rounded and adaptable individuals.</p><h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"why-did-i-doit\">Why did I do&nbsp;it?<a href=\"#why-did-i-doit\" class=\"hash-link\" aria-label=\"Direct link to Why did I do&nbsp;it?\" title=\"Direct link to Why did I do&nbsp;it?\">​</a></h2><p>The reason why I started OpenBB and also moved country is a combination of 2 factors:</p><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"product-or-mission-desperation\">Product or mission desperation.<a href=\"#product-or-mission-desperation\" class=\"hash-link\" aria-label=\"Direct link to Product or mission desperation.\" title=\"Direct link to Product or mission desperation.\">​</a></h3><p>On a startup level, I have experienced the need for an open-source investment research platform. That's why I wanted to create this platform, which was yet to exist. I think it wouldn't be possible if I didn't dedicate my time to it. This is why OpenBB's success is so important-it will enable millions of investors to have better access to data and better understand the financial market.</p><p>Growing up as an engineer fascinated by tech and innovation, the US has always been home to the biggest companies and hottest products. I've always been attracted to Silicon Valley, but before OpenBB, I never had the chance to. The first job I applied to after finishing university was Waymo in CA, but they didn't sponsor VISAs for that role.</p><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"desperation-to-do-something-big-or-important\">Desperation to do something big or important.&nbsp;<a href=\"#desperation-to-do-something-big-or-important\" class=\"hash-link\" aria-label=\"Direct link to Desperation to do something big or important.&nbsp;\" title=\"Direct link to Desperation to do something big or important.&nbsp;\">​</a></h3><p>On a startup level, I want to work on something bigger than myself. I want to solve a problem that no one has solved before and build something useful for millions of people that can withstand time.</p><p>I will do whatever it takes to build the first truly open-source investment research platform. Moving to SF increased my network opportunities with other entrepreneurs and builders from whom I can learn. I want to be fully immersed in this ecosystem and give it my all to do everything possible to help OpenBB succeed as a company, regardless of the outcome.</p><p>Note: A few weeks ago, I moved to NYC because I truly believe living here would increase the chances of OpenBB's success compared to living in SF.</p>",
            "url": "https://didierlopes.com/blog/moving-countries-and-starting-a-company-aint-so-different",
            "title": "Moving Countries and Starting a Company Ain't So Different",
            "summary": "I have started a company. I have moved countries. It turns out that there's a lot in common between these.",
            "date_modified": "2024-03-24T00:00:00.000Z",
            "tags": [
                "learning",
                "experience",
                "growth",
                "moving",
                "london",
                "bay",
                "US",
                "travel",
                "startup",
                "nyc"
            ]
        },
        {
            "id": "https://didierlopes.com/blog/moving-from-london-to-the-bay-area-and-what-changed",
            "content_html": "<p align=\"center\"><img loading=\"lazy\" width=\"600\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/7943cde2-0230-4577-9f83-cc5b75b23f28\" class=\"img_ev3q\"></p><p>The culture shock from moving to the Bay Area from London.</p><br><div style=\"border-top:1px solid #0088CC;margin:1.5em 0\"></div><p>A few months ago, I wrote a blogpost about what was needed in order for my wife and our 2 dogs to move to the Bay Area from London. You can check that blog post <a href=\"/blog/leaving-london-to-live-in-san-francisco/\">here</a>.</p><p>Since then, I’ve had some people asking me after living in the Bay for 1 year, what are the biggest differences I’ve experienced in terms of lifestyle &amp; culture.</p><p>I will write a section below for each of the major topics I experienced. Note that this is based on my experience, and you may disagree/have different opinions than me on some of these - which are very welcome.</p><h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"living-costs\">Living costs<a href=\"#living-costs\" class=\"hash-link\" aria-label=\"Direct link to Living costs\" title=\"Direct link to Living costs\">​</a></h2><p>Back in 2016 when I was at university, in Portugal, I used to pay 200 euros/month to live in an apartment with a roommate. My university cost was 800 euros/year and my parents gave me a monthly allowance of 300 euros/month to pay for food and anything else. I didn’t do many activities and would rarely go out, so I was able to live comfortably on that.</p><p>Once I moved to London (in 2017) to pursue a MSc. at Imperial College I was paying 1.6k £/month for a studio in Earl’s Court. This was walking distance from Imperial (didn’t have to pay for transportation) and was cheaper than the accommodations that the university offered. The university was no longer 800 euros/year, it cost £11k for the entire MSc (1 year).</p><p>So there was a shock that I experienced in terms of living costs from Lisbon to London.</p><p>Once I decided to move to the Bay Area (2023) I knew that the living costs were going to be higher, but in my head “how higher can these be?”.</p><p>Oh boy.</p><p>Apparently, a lot.</p><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"shopping\">Shopping<a href=\"#shopping\" class=\"hash-link\" aria-label=\"Direct link to Shopping\" title=\"Direct link to Shopping\">​</a></h3><p align=\"center\"><img loading=\"lazy\" width=\"600\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/eadb52a7-c6d8-4296-8cf9-540bff3393d9\" class=\"img_ev3q\"></p><p>This was the first shopping trip I had in the Bay (Whole foods is the equivalent to Waitrose in London, I often still confuse them and my wife finds it funny - anyway, they call it whole paycheck here bc $$$). These 10 items cost me $69.34. I couldn’t believe it.</p><p>Costco is arguably my favorite shop. It’s like a better IKEA. We would spend at least 2 hours shopping but we would get supplies for 3 weeks, the famous hot dog/pizza combo and put gas in the car. The membership (120$/year) pays itself really fast at Costco. The main downside is that since we were only 2 and I hate throwing food out, it happened a few times that I had to adapt my meals to make sure no food would go to waste. E.g. Eat a guacamole pack a day since the smaller pack brings 24 and it there were 24 days until the expiry date.</p><p>PS: I like Costco so much that I always took the friends/family who visited to it, as if it was an attraction. Sometimes we would even go directly to Costco from the airport, to breathe in Costco and all its magnificence upon arrival :D</p><p align=\"center\" class=\"flex items-center gap-2 justify-center\"><img loading=\"lazy\" width=\"300\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/4b235954-14a9-4e9f-aec2-02945f8285a0\" class=\"img_ev3q\"><img loading=\"lazy\" width=\"300\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/86a0e9a6-1bb2-4e74-b88c-9c6710a825b3\" class=\"img_ev3q\"></p><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"apartment\">Apartment<a href=\"#apartment\" class=\"hash-link\" aria-label=\"Direct link to Apartment\" title=\"Direct link to Apartment\">​</a></h3><p>Since I went to the US with the sole purpose of working hard and making OpenBB successful, I ended up picking a nice apartment in San Mateo - given that we spend 90% of our time at home. Our monthly rent for a 2-bedroom flat was 4.4k $/month with everything included (including both dogs rent, lol).</p><p>The apartment had a small gym, a common pool &amp; bbq area and an outdoor hot tub. But more importantly, it was located right by 101, walking distance from Peets &amp; Starbucks and very pet friendly. In addition, I was 40m from SF, 10m from the airport and 20m from Palo Alto. This meant that we were in a very calm area whilst being close to the most important hubs.</p><p>The common pool and BBQ area (+ the sunny weather) were insane, sometimes I wish I had spent more time there. But I guess you tend to value things more when you don’t have them :)</p><p align=\"center\"><img loading=\"lazy\" width=\"600\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/e4593db6-2e09-4a02-bed8-75960c0ffbe6\" class=\"img_ev3q\"></p><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"tipping-culture\">Tipping culture<a href=\"#tipping-culture\" class=\"hash-link\" aria-label=\"Direct link to Tipping culture\" title=\"Direct link to Tipping culture\">​</a></h3><p>In Europe, I very very rarely tipped. Not just me, but all people I know. It’s just not part of our culture. Everything is factored in. Even in London, most restaurants will have a “service charge” which is kind of a tip BUT it’s included in the bill and so you don’t need to think about how much you are going to tip.</p><p>In the US, if you don’t tip - people will judge you. The system is done in a way that tipping is not a “should” but closer to a “must”. Workers rely on your tips when thinking about their total compensation. And now I understand why my friends who work in restaurants/cafes enjoy Americans so much, it’s because they bring their tipping culture to Europe and so that extra money is very meaningful for European folks.</p><p>Some rules that I follow:</p><ul><li>If I go to a coffee shop and just do takeaway, I don’t tip. If I sit down in a table, then I tip between 15-20%.</li><li>When in a restaurant, I always tip. But the percentage varies based on the quality of the service and food. If I didn’t like it, I still tip 10%. If I really enjoy it then I tip 20%. If it was just good, I do 15%. This is a rule of thumb. In practice, I do this but then round to a multiple of $5 because yes (this is the equivalent to my wife not allowing odd numbers as the TV volume).</li></ul><p>The best way to get used to this is to just internally assume that 20% extra cost on whatever you are seeing on the menu. If a burger + drink costs $30, assume it will be $36 after taxes and tip.</p><p>Note that in restaurants they expect you to leave your credit card on the top of the bill. This is so they can “freeze” the bill and once they bring the receipt back they will wait for you to add the amount for the tip (+ total). Once you fill this and sign (in theory, the signing is mandatory) - only then they will be able to withdraw the bill amount + the tip.</p><p align=\"center\"><img loading=\"lazy\" width=\"600\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/51f2ba37-9c6c-4650-8ca2-814832776b1b\" class=\"img_ev3q\"></p><h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"sports\">Sports<a href=\"#sports\" class=\"hash-link\" aria-label=\"Direct link to Sports\" title=\"Direct link to Sports\">​</a></h2><p>Growing up in Portugal I used to watch every Benfica game and then in high school you would talk about the games you watched during the weekend. There was no other sport, it was a binary - either you are a soccer fan or you don’t watch any sports at all. When I moved to London, this changed slightly, there were people that liked other sports but Soccer was still the main sport by a very big margin. People would fill up a pub to watch Soccer only - maybe the other sport that came closest was Cricket.</p><p>In the US, people don’t really care about Soccer. It feels like it’s a sport that kids do, but adults don’t really talk about it or watch it. They know about Messi/Ronaldo, but aren’t really fans. On the other hand, American football, Basketball and Baseball are very big. Aquatic pole also seems to be popular in the Bay Area.</p><p>I remember when we got the apartment, I was walking my dogs and there was a soccer pitch nearby. I was super happy because I thought that I could do what I used to do in London and just show up to the ground on the weekend and do a pick-up play with random folks. Unfortunately, after several attempts of walking nearby I realized that the pitch was only used for kids to play soccer and never adults. In London, on a sunny day, it’s hard (maybe impossible?) to find a soccer field empty.</p><p align=\"center\" class=\"flex items-center gap-2 justify-center\"><img loading=\"lazy\" width=\"300\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/cb761c23-af50-4b6e-a9a8-77d61d8308f3\" class=\"img_ev3q\"><img loading=\"lazy\" width=\"300\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/1c6ff214-3d26-4dba-b6a5-43cf372daa30\" class=\"img_ev3q\"></p><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"college-sports\">College sports<a href=\"#college-sports\" class=\"hash-link\" aria-label=\"Direct link to College sports\" title=\"Direct link to College sports\">​</a></h3><p>While in Europe in general, no one cares about college sports. The reality in the US is completely different. Not only do they fill their stadiums with 50k+ people, but these games bring a TON of money. People will literally sit outside the stadium in the morning and wait for the time of the match. It’s called tailgating.</p><p align=\"center\"><img loading=\"lazy\" width=\"600\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/2410db28-8a94-4dd2-abc4-fedda21f69cf\" class=\"img_ev3q\"></p><p>I’ve noticed that some people don’t even go to the stadium, they just sit outside the stadium watching the game in the car park on their TV and drinking. I still don’t fully get why you would do that, but I guess it’s a tradition.</p><p align=\"center\"><img loading=\"lazy\" width=\"600\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/5865346c-c9d2-4591-b59b-4a32fd793ba8\" class=\"img_ev3q\"></p><h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"working-culture\">Working Culture<a href=\"#working-culture\" class=\"hash-link\" aria-label=\"Direct link to Working Culture\" title=\"Direct link to Working Culture\">​</a></h2><p>My plan was to live in the US for the duration of my visa (O-1) and then return after 3 years. But the working culture is the reason why I hope to stay for longer. Most people you will meet in the Bay work very hard. They don’t finish the day at 5/6pm but do long hours to get shit done. What motivates them is building the future and being part of something bigger than themselves.</p><p>In London, I felt like the culture was very strong towards finishing your working day and going to the pub at 5/6pm - get drunk. And then repeat. Before London I didn’t drink alcohol, and in London I started drinking sometimes to socialize. In the Bay I feel like there isn’t an expectation that everyone wants to drink, and people leave events early because they want to head home to work on something - which is something I used to do back in London.</p><p>I also feel like in the Bay Area, when you go to events you can talk about what you are working on without people judging you for bringing “work” into the conversation. And I tend to find these conversations more interesting. In London, there’s less emphasis in tech, and the interests tend to be a bit broader: music, arts, history, etc..</p><p>While people say that London is a big hub for startups &amp; founders, I didn’t find this to be the case. In the Bay Area, the likelihood of you encountering someone on the street and them working at a startup (most of the time their own) is really high. You can even feel the strength of this tech community on Twitter, whereas that doesn’t exist (AFAIK) in London.</p><p align=\"center\"><img loading=\"lazy\" width=\"600\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/de60d56a-194e-4f62-8aaa-20e3451936e1\" class=\"img_ev3q\"></p><p>Elad Gil fireside with Satya Nadella at Stripe's HQ</p><p></p><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"equity-as-part-of-compensation-package\">Equity as part of compensation package<a href=\"#equity-as-part-of-compensation-package\" class=\"hash-link\" aria-label=\"Direct link to Equity as part of compensation package\" title=\"Direct link to Equity as part of compensation package\">​</a></h3><p>Most European startups do not offer any equity. In the Bay Area, all startups offer equity. The earlier you join (higher risk) the more meaningful the options you get are. One of the reasons this works is because US employees are, in general, hard-working and will go the long way for their company. So this makes it so that incentives are aligned, and employees want to work harder because that equity can become much more meaningful than their base salary (potentially life-changing).</p><p>One of the reasons this works so well is that pretty much every US person knows someone in firsthand who made f-u money by selling their shares in secondaries, or has at least heard stories about this. While I was in the UK, before starting OpenBB, I didn’t hear about this once. Also because companies have no interest in offering you equity if they don’t have to.</p><p>E.g. at my previous startup I used to stay working late into the night, because in my perspective this would increase the startup's chances of success. However, I had no equity. So this meant that if the startup was wildly successful, I would have no direct gains from it and the company would not owe me anything. Offering equity through a typical 4-year vesting schedule (with 1-year cliff) provides the perfect type of alignment.</p><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"holidays\">Holidays<a href=\"#holidays\" class=\"hash-link\" aria-label=\"Direct link to Holidays\" title=\"Direct link to Holidays\">​</a></h3><p>The amount of holidays is a good example that demonstrates the hard-working culture that so well characterizes the US. In the US they are used to having 2-weeks off in a full calendar year. In London, most companies offer at least 4-weeks, which is effectively 2x the number of holidays.</p><h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"driving-culture\">Driving culture<a href=\"#driving-culture\" class=\"hash-link\" aria-label=\"Direct link to Driving culture\" title=\"Direct link to Driving culture\">​</a></h2><p>The London underground works impressively, I lived there for 5 years and never once even considered owning a car.</p><p>I thought I could do the same in the US and people were being dramatic. That thought lasted maybe 2 days?</p><p>On the first day I had to go to Fedex which was a 15-20m walk, and when I told the apartment administrator that I was going to walk there she looked at me like I was crazy and said “you need to take your car”. After walking there I understood what she meant and that unless you are in a city, the pedestrian sidewalks/roads just aren’t prepared for pedestrians.</p><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"differences\">Differences<a href=\"#differences\" class=\"hash-link\" aria-label=\"Direct link to Differences\" title=\"Direct link to Differences\">​</a></h3><ul><li>You drive on the right (x2) side of the road. Since I didn’t drive in the UK, this was very easy for me as I’m used to driving in Portugal where we also drive on the right side of the road.</li><li>In the UK (or Europe, in general) having more than 3 lanes on the highway is atypical. In the US, having 6 lanes it’s considered normal. Sometimes it’s tricky and you can’t be in the most right side because the 2 right lanes may both exit and thus you need to hop over 2 lanes to keep on the same route. This mistake can be costly.</li><li>There are very very few roundabouts in the Bay. There are a LOT of intersections. I like it less (not because I think it’s slower) but because it’s more “boring” to wait for the green light and from my point of view, people are more likely to grab their phone during that time because they don’t need to pay as much attention, at least compared to a roundabout where you are waiting for an opening to keep moving. (there are so few roundabouts that the first time I saw one I took a picture to share with my wife)</li><li>There’s a “Right on Red” policy. This means that if you are at an intersection and it’s red for you to proceed if there’s no incoming car from the left side you can turn right on the red. I like this because it allows for traffic to flow better. My wife doesn’t like it because as a pedestrian sometimes cars start accelerating and don’t respect pedestrian as much. Nonetheless, I love to make this joke when people from Europe visit, where I say that I’m going to pass a red and they are shocked when they see me turning right on a red light.</li><li>In the Bay they have FastTrack which allows people to pay to use the most-left lane and avoid traffic. Although this is capitalist I like it because if I’m in a rush I can pay a few dollars to avoid the congestion - it’s a type of SaaS - Speed as a Service 😄</li></ul><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"waymo\">Waymo<a href=\"#waymo\" class=\"hash-link\" aria-label=\"Direct link to Waymo\" title=\"Direct link to Waymo\">​</a></h3><p>Waymo, a self-driving car division that started off Google, was the first startup I applied to when I finished university. I have been bullish on self-driving cars since university - my dissertation was on that topic and I had to propose it myself, since there were no proposals for such. So seeing Waymo operating in SF was mind-blowing to me.</p><p>Autonomous cars are a matter of time - and SF (and the Bay Area) being the city where Waymo starts operating, shows a lot about how progressive this city is. I recommend everyone to try one out.</p><p>My dad, someone who was born and raised in a small town in Portugal, and who understands very little about technology seeing this was something. Him seated in the passenger’s seat for the full 16 min drive recording a wheel with no driver and ending the journey telling me “I never thought I would see this in my life, thank you” is something that no amount of money in this world could buy.</p><p align=\"center\" class=\"flex items-center gap-2 justify-center\"><img loading=\"lazy\" width=\"300\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/20ca7ae8-6eb8-4059-9d1b-006f73c1ca58\" class=\"img_ev3q\"><img loading=\"lazy\" width=\"300\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/f63f7ff1-91b0-4124-adb6-6d1780eb37fc\" class=\"img_ev3q\"></p><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"driving-license\">Driving license<a href=\"#driving-license\" class=\"hash-link\" aria-label=\"Direct link to Driving license\" title=\"Direct link to Driving license\">​</a></h3><p>Even though I have a Portuguese driving license since I was 18. That’s only accepted for 10 days or so - and if you have an international driving license for it to work for longer (I didn’t go this route). So I had to apply for a California Driving License (CDL) which meant taking a written exam and doing a driving test.</p><p>The written exam was actually fairly easy compared to the one I had in Portugal. In the Bay, the test consists of 36 multiple-choice questions, and you are allowed to fail up to 6 questions.  In Portugal I had 30 multiple-choice questions and could only fail up to 3.</p><p>I found the written exam to be easy after doing multiple practice tests online. Most of the questions ended up being somewhat similar to the ones I had practiced the day before.</p><p>Doing the written exam was very different though. In Portugal we did it in a closed room with someone watching us and everyone else in silence. In the Bay Area I did it in a corner of the DMV with a lot of background noise behind me. I had to use both my hands to cover my ears to be able to focus, which was annoying.</p><p>The driving exam is much easier than the one I did in Portugal. It lasted for maybe 20-25 minutes and it was just around the DMV. When doing it in Portugal, the test lasts 40 minutes and includes: parallel parking, reversing while tracking a curb (without touching it), stopping in a hill (harder when driving with a stick), roundabout and highway.</p><p>Also, the DMV is as bad as they say it is. This movie scene is pretty accurate:</p><p align=\"center\"><img loading=\"lazy\" width=\"600\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/bfd90829-f114-43bb-960c-856b31272433\" class=\"img_ev3q\"></p><h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"cards\">Cards<a href=\"#cards\" class=\"hash-link\" aria-label=\"Direct link to Cards\" title=\"Direct link to Cards\">​</a></h2><p>In the US, as in the UK, the driving license acts as citizen card. Even if you don’t drive it’s worth getting your drivers license since everywhere you go that is used for you to prove who you are.</p><p>When doing anything official in the UK, you get asked about your passport (and the passport number). That ID is all they need to recognize who you are. In the US you have a Social Security Number (SSN) which is this super-confidential number that you are meant to keep secret, yet they keep asking you about it when you rent an apartment, set up a phone plan, go to the doctor, buy a car, … It’s a weird concept. The difference is that in the UK if someone gets your passport number, nothing really happens. In the US if someone gets your SSN, it can be used to commit fraud, open new credit and bank accounts, obtain employment, and access medical care or other benefits.</p><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"debit-vs-credit-card\">Debit vs credit card<a href=\"#debit-vs-credit-card\" class=\"hash-link\" aria-label=\"Direct link to Debit vs credit card\" title=\"Direct link to Debit vs credit card\">​</a></h3><p>In Portugal and the UK, I only had a Debit card which had access to all the cash in the bank. When moving to the Bay Area, everyone told me to get a credit card and leave the debit card at home. There are a lot of scams in the US, and having a credit card is safer since banks limit the withdrawal amounts based on your credit score and will protect in case of theft.</p><p>In the UK, there isn’t a concept of a credit score - at least publicly. Banks will have something like that based on how on time you pay for things, but it’s only used internally for loans or others. In the US, everything revolves around your credit score. The amount of money you can withdraw from your credit card, the loans you get, the apartments you can rent, … so it’s important to pay everything on time and avoid debt.</p><h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"employment\">Employment<a href=\"#employment\" class=\"hash-link\" aria-label=\"Direct link to Employment\" title=\"Direct link to Employment\">​</a></h2><p>Employment in the US is very different from the one in the UK. </p><p>In the UK, you get paid a value at the end of the month that corresponds to the value you take home and the employer handles both your Income taxes and the National insurance (which goes to the NHS).</p><p>In the US, you need to handle your taxes at the end of a fiscal year. There are multiple taxes applied and hence it’s not as simple as the tax system that exists in the UK.</p><p>In addition, there isn’t a public “free” NHS (healthcare) in the United States. As an individual, you need to select the plan you are interested in (based on a few choices that your employer offers you). Hence you need to consider not only what the monthly premium entails, but how the deductible works - and as weird as it sounds you need to “estimate” your likelihood of getting into an accident to select something that works for you. This is hard to grasp coming from a country where there’s “free” healthcare and everyone has access to the same services.</p><h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"others\">Others<a href=\"#others\" class=\"hash-link\" aria-label=\"Direct link to Others\" title=\"Direct link to Others\">​</a></h2><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"student-debt\">Student debt<a href=\"#student-debt\" class=\"hash-link\" aria-label=\"Direct link to Student debt\" title=\"Direct link to Student debt\">​</a></h3><p>In Portugal, the concept of student debt doesn’t really exist. In general, parents pay their kids' tuition. This is possible because the tuition costs for public universities aren’t very high.</p><p>In the UK, students tend to have student debt since university costs can be rather expensive (e.g. around 10k pounds/year). </p><p>In the US, student debt is much higher. We are talking about starting a career with 300k in student loans, which is absolutely wild.</p><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"phone-plan\">Phone plan<a href=\"#phone-plan\" class=\"hash-link\" aria-label=\"Direct link to Phone plan\" title=\"Direct link to Phone plan\">​</a></h3><p>While I was paying around 8 pounds/month for my UK phone plan with unlimited data. For a similar plan in the US, the cost is around 70 $/month. A funny story about this is when I bought my phone plan, they told me that the cost was 70$ for their cheapest plan and I thought they meant yearly. When they told me it was monthly, I had to call my co-founder to make sure this wasn’t a rip-off. To which he said: “Welcome to the US”.</p><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"guns--alcohol\">Guns &amp; Alcohol<a href=\"#guns--alcohol\" class=\"hash-link\" aria-label=\"Direct link to Guns &amp; Alcohol\" title=\"Direct link to Guns &amp; Alcohol\">​</a></h3><p>In the UK (and Europe in general), it’s illegal to own a gun and you can start drinking at 18 years old. In the US, you can buy a gun as soon as you are 18 but aren’t allowed to drink until 21. </p><p>And also, Kinder Surprise is illegal in the US because of the toy that comes inside. So you can’t buy a chocolate with a toy inside because you can choke on it, but can go to the store to buy a gun.</p><p align=\"center\" class=\"flex items-center gap-2 justify-center\"><img loading=\"lazy\" width=\"300\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/1f334692-401b-47ad-a89f-ac5755e8e747\" class=\"img_ev3q\"><img loading=\"lazy\" width=\"300\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/a4410b7c-db8b-4739-be67-a3f4b4bdc466\" class=\"img_ev3q\"></p><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"dog-parks\">Dog Parks<a href=\"#dog-parks\" class=\"hash-link\" aria-label=\"Direct link to Dog Parks\" title=\"Direct link to Dog Parks\">​</a></h3><p>One of my all-time favorite things in the US and that Europe in general should learn from. The US has a LOT of dog parks. These are spaces that are gated where people bring their dogs for them to play together. These spaces come fully prepared with water, bags, cleaning kits and even seats. I’ve seen friends hang out at the park while their dogs are having fun playing with other dogs. These parks usually also have 2 areas, one for smaller and one for larger dogs - which is great since we have a small pomeranian.</p><p align=\"center\"><img loading=\"lazy\" width=\"600\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/c6f28500-4ba6-48f3-a68e-28a34b401e85\" class=\"img_ev3q\"></p><h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"conclusion\">Conclusion<a href=\"#conclusion\" class=\"hash-link\" aria-label=\"Direct link to Conclusion\" title=\"Direct link to Conclusion\">​</a></h2><p>Overall, I'm very happy that I moved to the US. I think it was the right decision for both the company and my family. Plus the network that I'm building between other founders, customers and investors is something that I couldn't have done in Europe.</p>",
            "url": "https://didierlopes.com/blog/moving-from-london-to-the-bay-area-and-what-changed",
            "title": "Moving from London to the Bay Area and what changed",
            "summary": "Moving from London to the Bay Area and what changed",
            "date_modified": "2024-03-02T00:00:00.000Z",
            "tags": [
                "learning",
                "experience",
                "growth",
                "moving",
                "london",
                "bay",
                "US",
                "travel"
            ]
        },
        {
            "id": "https://didierlopes.com/blog/openbb-copilot-now-available-to-all-terminal-pro-users",
            "content_html": "<p align=\"center\"><img loading=\"lazy\" width=\"600\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/64b9e7a6-2720-4bd5-97ff-a62d9900820e\" class=\"img_ev3q\"></p><p>For the past few weeks, we’ve been working on the OpenBB Copilot, an ever-present financial analyst at your fingertips with the OpenBB Terminal Pro.</p><br><div style=\"border-top:1px solid #0088CC;margin:1.5em 0\"></div><p>The <a href=\"https://openbb.co/use-cases/ai\" target=\"_blank\" rel=\"noopener noreferrer\">OpenBB Copilo</a> is our latest addition to the <a href=\"https://openbb.co/products/pro\" target=\"_blank\" rel=\"noopener noreferrer\">Terminal Pro</a>, and we could not be more excited to share it with you.</p><p>If you don't have access yet, join the <a href=\"https://my.openbb.co/app/pro/early-access\" target=\"_blank\" rel=\"noopener noreferrer\">Terminal Pro waitlist</a> and enjoy your 3-week free trial soon!</p><p>Now, take a moment to meet your new <strong>AI investment research partner</strong>.</p><h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"what-can-the-openbb-copilot-do\">What can the OpenBB Copilot do?<a href=\"#what-can-the-openbb-copilot-do\" class=\"hash-link\" aria-label=\"Direct link to What can the OpenBB Copilot do?\" title=\"Direct link to What can the OpenBB Copilot do?\">​</a></h2><p>OpenBB Copilot is multi-functional and can perform several tasks that are useful to analysts. We’ll be exploring these below.</p><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"generic-financial-knowledge\">Generic financial knowledge<a href=\"#generic-financial-knowledge\" class=\"hash-link\" aria-label=\"Direct link to Generic financial knowledge\" title=\"Direct link to Generic financial knowledge\">​</a></h3><p>Using OpenBB Copilot, you can ask any general financial question. For example:</p><p><strong>What is the P/E ratio?</strong></p><video controls=\"\"><source src=\"https://openbb-cms.directus.app/assets/7c8c9658-4c4d-4090-8a61-826de823981b\"></video><p>As an additional bonus feature, OpenBB Copilot includes a LaTeX renderer to display mathematical formulas and equations.</p><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"conversation-capability\">Conversation capability<a href=\"#conversation-capability\" class=\"hash-link\" aria-label=\"Direct link to Conversation capability\" title=\"Direct link to Conversation capability\">​</a></h3><p>OpenBB Copilot is a conversational agent and is, therefore, aware of the chat history of the current conversation.</p><p>As a result, you can ask follow-up questions and steer OpenBB Copilot toward your line of inquiry while developing an investment thesis.</p><p>To clear the message history, for example, when investigating a new asset, you can click on the trashcan icon to start a new conversation.</p><video controls=\"\"><source src=\"https://openbb-cms.directus.app/assets/3e1170f2-59b4-458a-bc6e-cd86c688b8db\"></video><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"terminal-pro-as-context\">Terminal Pro as context<a href=\"#terminal-pro-as-context\" class=\"hash-link\" aria-label=\"Direct link to Terminal Pro as context\" title=\"Direct link to Terminal Pro as context\">​</a></h3><p>If you ask questions about the data on the dashboard, OpenBB Copilot will query the Terminal Pro for the data necessary to answer your query.</p><p>The Copilot has access to the dashboard metadata on the backend and can decide to retrieve data from any of the widgets currently on your dashboard.</p><p>In most cases, if you can see the data on your dashboard, you can assume OpenBB Copilot has access to it.</p><video controls=\"\"><source src=\"https://openbb-cms.directus.app/assets/6c22201f-67ce-49a7-ab4d-213b594c657b\"></video><p>This is an application of what’s known in the AI world as function calling, which allows LLMs to interact with external systems.</p><p>The OpenBB Copilot can choose to automatically retrieve the data from your dashboard if it needs it to answer your query.</p><p>The advantage of this approach is that, since you can retrieve data from any widget, you can also expand OpenBB Copilot’s knowledge by adding custom widgets or by bringing your own data to the Terminal Pro.</p><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"query-specific-widgets\">Query specific widgets<a href=\"#query-specific-widgets\" class=\"hash-link\" aria-label=\"Direct link to Query specific widgets\" title=\"Direct link to Query specific widgets\">​</a></h3><p>Sometimes, you may wish to focus your analysis and use OpenBB Copilot with only a specific subset of widgets.</p><p>For example, you may want to use OpenBB Copilot to assist you in a deep analysis of an earnings transcript in the \"Earnings Transcript\" widget without retrieving data from the rest of the dashboard.</p><p>To achieve this, you can chat with specifically selected widgets by clicking on the \"Add widgets as context\".</p><video controls=\"\"><source src=\"https://openbb-cms.directus.app/assets/dc74b30a-73ed-4b85-af23-9bb8ab9c844c\"></video><p>Selecting a widget will make that widget's data available to OpenBB Copilot while excluding all the other widgets.</p><p>You can then use the Copilot as normal and the unselected widgets will be ignored by the Copilot.</p><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"query-your-own-documents\">Query your own documents<a href=\"#query-your-own-documents\" class=\"hash-link\" aria-label=\"Direct link to Query your own documents\" title=\"Direct link to Query your own documents\">​</a></h3><p>You’re also not limited by the data that is available in Terminal Pro.</p><p>You can upload your own documents for OpenBB Copilot to use as context while answering your queries.</p><p>OpenBB Copilot currently supports txt, PDF, CSV and XLSX documents.</p><video controls=\"\"><source src=\"https://openbb-cms.directus.app/assets/dec690c2-ed07-40c1-8b3e-ff0ad7294258\"></video><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"citations\">Citations<a href=\"#citations\" class=\"hash-link\" aria-label=\"Direct link to Citations\" title=\"Direct link to Citations\">​</a></h3><p>We understand that sometimes getting an answer from an AI chatbot with financial knowledge isn’t satisfactory.</p><p>You often want to do further research or do your own fact-checking of the sources used to answer to your query.</p><p>That is why OpenBB Copilot provides citations as part of its answers.</p><p>When using the Terminal Pro as context or chatting with your uploaded data files, the Copilot will cite which data sources it used to formulate the answers.</p><p>Simply mouse over the citation to see which widget data was used, or which uploaded file was referenced. For PDF document specifically, the Copilot will also source the specific page that was used to answer your query.</p><video controls=\"\"><source src=\"https://openbb-cms.directus.app/assets/e35a0b2c-8150-4d2b-9743-a72862ba3b6d\"></video><h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"what-if-you-dont-want-to-use-our-copilot\">What if you don't want to use our copilot?<a href=\"#what-if-you-dont-want-to-use-our-copilot\" class=\"hash-link\" aria-label=\"Direct link to What if you don't want to use our copilot?\" title=\"Direct link to What if you don't want to use our copilot?\">​</a></h2><p>You don’t have to. That is the reason we came up with the Bring Your Own Copilot concept.</p><p>If you’re an OpenBB Terminal Pro user, you’re able to bring your own financial Copilot that has been fine-tuned and tweaked on your enterprise’s private data.</p><p>This provides an edge to financial firms as they can access their own fine-tuned LLM with access to real-time data provided by the OpenBB Terminal Pro - making this the perfect combo to perform investment research.</p><p>We have an <a href=\"https://github.com/OpenBB-finance/copilot-for-terminal-pro/tree/main\" target=\"_blank\" rel=\"noopener noreferrer\">open-source repository</a> to help you make your own copilots accessible on the Terminal Pro.</p><p>You can also see the video below:</p><video controls=\"\"><source src=\"https://openbb-cms.directus.app/assets/2703e8d8-2497-40ab-b513-678d78989f5b\"></video><br><p>Check out our <a href=\"https://openbb.co/use-cases/ai\" target=\"_blank\" rel=\"noopener noreferrer\">AI page</a> to learn more about these features and stay updated in the future.</p>",
            "url": "https://didierlopes.com/blog/openbb-copilot-now-available-to-all-terminal-pro-users",
            "title": "OpenBB Copilot is now available to all Terminal Pro users",
            "summary": "Introducing the OpenBB Copilot, an ever-present financial analyst at your fingertips with the OpenBB Terminal Pro.",
            "date_modified": "2024-02-27T00:00:00.000Z",
            "tags": [
                "openbb",
                "copilot",
                "generative ai",
                "ai",
                "llm"
            ]
        },
        {
            "id": "https://didierlopes.com/blog/12-things-i-learned-in-2023",
            "content_html": "<p align=\"center\"><img loading=\"lazy\" width=\"600\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/4282e396-9f42-42aa-90aa-62624dd8f1c2\" class=\"img_ev3q\"></p><br><div style=\"border-top:1px solid #0088CC;margin:1.5em 0\"></div><p>The 12 things I learned in 2023</p><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"1-dont-delegate-anything-that-you-wouldnt-do-yourself\">1. Don't delegate anything that you wouldn't do yourself.<a href=\"#1-dont-delegate-anything-that-you-wouldnt-do-yourself\" class=\"hash-link\" aria-label=\"Direct link to 1. Don't delegate anything that you wouldn't do yourself.\" title=\"Direct link to 1. Don't delegate anything that you wouldn't do yourself.\">​</a></h3><p>It's extremely important to work on little things to show your team that nothing is too small to spend time on, and sets a precedent that you are willing to work on the ground next to them.</p><p>E.g. Elon Musk sleeping at the gigafactory to show his team that he was there next to them.</p><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"2-be-curious-and-humble-enough-to-be-willing-to-ask-dumb-questions\">2. Be curious and humble enough to be willing to ask dumb questions.<a href=\"#2-be-curious-and-humble-enough-to-be-willing-to-ask-dumb-questions\" class=\"hash-link\" aria-label=\"Direct link to 2. Be curious and humble enough to be willing to ask dumb questions.\" title=\"Direct link to 2. Be curious and humble enough to be willing to ask dumb questions.\">​</a></h3><p>If I don't know something, I never pretend understanding what the person is talking about.</p><p>I would take the knowledge over a \"smart\" label, any day.</p><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"3-implement-feedback-loops-on-everything-you-do-otherwise-you-cant-adapt\">3. Implement feedback loops on everything you do, otherwise you can't adapt.<a href=\"#3-implement-feedback-loops-on-everything-you-do-otherwise-you-cant-adapt\" class=\"hash-link\" aria-label=\"Direct link to 3. Implement feedback loops on everything you do, otherwise you can't adapt.\" title=\"Direct link to 3. Implement feedback loops on everything you do, otherwise you can't adapt.\">​</a></h3><p>Last year I decided to work on <a href=\"https://openbb.co/company/open/team\" target=\"_blank\" rel=\"noopener noreferrer\">tracking our employee engagement</a>, and this is one of the best and most valuable initiatives I have worked on.</p><p>It has provided us tons of feedback that we were able to act on, and improve what it's like to work for OpenBB. More information on this <a href=\"https://openbb.co/blog/employee-engagement\" target=\"_blank\" rel=\"noopener noreferrer\">here</a>.</p><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"4-ux-is-more-important-than-ui\">4. UX is more important than UI.<a href=\"#4-ux-is-more-important-than-ui\" class=\"hash-link\" aria-label=\"Direct link to 4. UX is more important than UI.\" title=\"Direct link to 4. UX is more important than UI.\">​</a></h3><p>I keep seeing tweets about UI improvements on a website and/or product. I love that type of posts, and wish there was a similar trend going on for UX improvements.</p><p>While UI is critical to attract users, UX is king to retain them.</p><p>It’s like dating - the looks is in the UI and the personality is the UX.</p><p>While they may be perceived as their own separate bubble, they are not. Someone with an amazing personality (UX) will appear as more beautiful (UI).</p><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"5-if-in-presence-of-a-2-way-door-decision-you-should-decide-fast\">5. If in presence of a 2-way door decision, you should decide fast.<a href=\"#5-if-in-presence-of-a-2-way-door-decision-you-should-decide-fast\" class=\"hash-link\" aria-label=\"Direct link to 5. If in presence of a 2-way door decision, you should decide fast.\" title=\"Direct link to 5. If in presence of a 2-way door decision, you should decide fast.\">​</a></h3><p>Being fast to decide to do A instead of B in a 2-way door decision is ideal because even if that wasn’t the correct decision, adapting after will still be better than being stuck at the decision stage.</p><p>Plus, you’ll be surprised by how many time you actually get it right given the level of context and knowledge you have in the space.</p><p>Knowing what is a 1 and a 2-way door decision, separates great from poor leaders.</p><p>I like <a href=\"https://tiktok.com/@evancarmichael/video/7317081673865235717\" target=\"_blank\" rel=\"noopener noreferrer\">this video</a> from Jeff Bezzos talking about this.</p><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"6-theres-a-ton-of-data-in-intuition-and-common-sense\">6. There’s a ton of data in intuition and common sense.<a href=\"#6-theres-a-ton-of-data-in-intuition-and-common-sense\" class=\"hash-link\" aria-label=\"Direct link to 6. There’s a ton of data in intuition and common sense.\" title=\"Direct link to 6. There’s a ton of data in intuition and common sense.\">​</a></h3><p>As a leader, most of the times you have to make decisions with no hard data evidence. And by hard data I mean a spreadsheet with numbers or a powerpoint with charts.</p><p>However, you do have that data. It’s just not in a clean format and lives on your head.</p><p>This data has been aggregating by spending more time thinking about the problem you are solving than anyone else, by talking with customers, by talking with partners, and everything in between.</p><p>Trust your intuition, more often than not presentations are done to justify decisions that you knew were right all along. Skip that and you will be able to move faster.</p><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"7-hear-feedback-from-everyone-but-only-listen-from-a-few\">7. Hear feedback from everyone but only listen from a few.<a href=\"#7-hear-feedback-from-everyone-but-only-listen-from-a-few\" class=\"hash-link\" aria-label=\"Direct link to 7. Hear feedback from everyone but only listen from a few.\" title=\"Direct link to 7. Hear feedback from everyone but only listen from a few.\">​</a></h3><p>People paying for your product, will provide you 10x feedback compared to others. Use common sense for others.</p><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"8-be-there-for-your-team\">8. Be there for your team.<a href=\"#8-be-there-for-your-team\" class=\"hash-link\" aria-label=\"Direct link to 8. Be there for your team.\" title=\"Direct link to 8. Be there for your team.\">​</a></h3><p>Make sure to remind your team that you couldn't do it without them.</p><p>A single off-line event per year is not enough.</p><p>Show that you care by being there: asking about their family/pets/hobbies, messaging them when they perform above expectations, send them gifts when something negative happens, ... act like a friend but manage like a captain</p><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"9-fire-b-and-c-players-early\">9. Fire B and C players early.<a href=\"#9-fire-b-and-c-players-early\" class=\"hash-link\" aria-label=\"Direct link to 9. Fire B and C players early.\" title=\"Direct link to 9. Fire B and C players early.\">​</a></h3><p>Keeping a team of A players is hard but extremely rewarding, and necessary. </p><p>It sets the precedent that average work is not enough to work at your company, and high performers will want to work for you to be surrounded by people that push them everyday.</p><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"10-distribution-is-more-important-than-product\">10. Distribution is more important than product.<a href=\"#10-distribution-is-more-important-than-product\" class=\"hash-link\" aria-label=\"Direct link to 10. Distribution is more important than product.\" title=\"Direct link to 10. Distribution is more important than product.\">​</a></h3><p>Took me some time to understand this, but I have no doubts about this now.</p><p>This is why the sentence of “A good product with great distribution will almost always beat a great product with poor distribution.”</p><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"11-leave-your-comfort-zone\">11. Leave your comfort zone.<a href=\"#11-leave-your-comfort-zone\" class=\"hash-link\" aria-label=\"Direct link to 11. Leave your comfort zone.\" title=\"Direct link to 11. Leave your comfort zone.\">​</a></h3><p>I'm really shy on stage and this year I've presented a few times. And I’ve impressed myself, while I'm far from good I've come a long way.</p><p>When i started learning english my goal was to be able to make people laugh in english, that took a while.</p><p>I've now been able to make people laugh whilst on stage and I didn't expect that I’d be able to do this anytime soon.</p><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"12-tell-your-loved-ones-how-much-they-mean-to-you\">12. Tell your loved ones how much they mean to you.<a href=\"#12-tell-your-loved-ones-how-much-they-mean-to-you\" class=\"hash-link\" aria-label=\"Direct link to 12. Tell your loved ones how much they mean to you.\" title=\"Direct link to 12. Tell your loved ones how much they mean to you.\">​</a></h3><p>Most of us have someone by our side that allow us to keep performing at highest level day in and day out.</p><p>Ensure they know you couldn't be the person you are today without them.</p>",
            "url": "https://didierlopes.com/blog/12-things-i-learned-in-2023",
            "title": "12 Things I Learned in 2023",
            "summary": "The 12 things I learned in 2023",
            "date_modified": "2024-01-22T00:00:00.000Z",
            "tags": [
                "learning",
                "experience",
                "growth"
            ]
        },
        {
            "id": "https://didierlopes.com/blog/introducing-the-openbb-add-in-for-excel",
            "content_html": "<p align=\"center\"><img loading=\"lazy\" width=\"600\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/4ca4c4a8-99bd-45b8-b7c9-3a43577c620e\" class=\"img_ev3q\"></p><br><p>We acknowledged the enduring centrality of Excel in the financial sector, so we're now making data from the Terminal Pro readily available in Excel. We're also excitedly working to integrate the \"Bring Your Own Data\" feature into our Excel Add-in, a move we foresee as a transformative step in the financial data industry.</p><div style=\"border-top:1px solid #0088CC;margin:1.5em 0\"></div><h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"introduction\">Introduction<a href=\"#introduction\" class=\"hash-link\" aria-label=\"Direct link to Introduction\" title=\"Direct link to Introduction\">​</a></h2><p>Building something people truly want requires direct engagement with them. After conducting over 100 interviews with analysts and quants, three key insights surfaced:</p><ol><li><p>The financial world runs on Excel.</p></li><li><p>The primary value of the OpenBB Terminal Pro lies in its customization (bring your own data + widget/dashboard creation) and AI features.</p></li><li><p>The financial world, <strong>LITERALLY</strong>, still runs on Excel.</p></li></ol><p>For topic number 2, we were well underway towards building the <a href=\"https://openbb.co/products/pro\" target=\"_blank\" rel=\"noopener noreferrer\">Terminal Pro</a> as the most customizable and efficient financial terminal.</p><p>But for topics number 1 and 3, we weren’t.</p><p>So we devised a small task force to tackle this effort and work with design partners towards building the <a href=\"https://openbb.co/products/excel\" target=\"_blank\" rel=\"noopener noreferrer\">OpenBB Add-in for Excel</a>.</p><p>The goal was simple: <strong>financial data available on the Terminal Pro should be accessible in Excel</strong>.</p><p>But as we do for all our products, we wanted to understand where this product would sit in our ecosystem.</p><p>Since the Terminal Pro offers a basic data tier (including historical price, fundamentals, analyst estimates, news, macro-economy, and forex) with redistribution rights, we decided to make those same datasets available in Excel.</p><p align=\"center\"><img loading=\"lazy\" width=\"600\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/9a37a99b-cc82-42a6-a322-4db6e0d124da\" class=\"img_ev3q\"></p><h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"getting-started\">Getting Started<a href=\"#getting-started\" class=\"hash-link\" aria-label=\"Direct link to Getting Started\" title=\"Direct link to Getting Started\">​</a></h2><p>So, in simple terms, we allow the user to access financial data right from Excel, by connecting with the OpenBB server to do the data request.</p><p>In the example below you can see that we are using the formula <code>=OBB.EQUITY.ESTIMATES.PRICE_TARGET(\"AAPL\")</code> which retrieves the latest data about AAPL’s price target.</p><p>You can read more information about it in our <a href=\"https://docs.openbb.co/excel/reference/equity/estimates/price_target\" target=\"_blank\" rel=\"noopener noreferrer\">Documentation</a>.</p><p>This is how it looks:</p><p align=\"center\"><img loading=\"lazy\" width=\"600\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/5e8e2dbd-000e-4f84-8fce-654117b1ddf7\" class=\"img_ev3q\"></p><p>This was a huge step for us.</p><p>However, another question came up:</p><p><strong>As the datasets keep expanding, discoverability will become a big problem.</strong></p><p>And we haven’t been around for 40 years for users to be familiar with our terminology.</p><p>So, how would users know what function to use, to access the datasets they are interested in?</p><p>We figured that enterprise users would be interested in accessing the data they are already visualizing in the <a href=\"https://openbb.co/products/pro\" target=\"_blank\" rel=\"noopener noreferrer\">OpenBB Terminal Pro</a>.</p><p>So we allowed them to get the Excel function directly from each widget:</p><p align=\"center\"><img loading=\"lazy\" width=\"600\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/3cfc1276-ee52-4759-8903-eff92542ece9\" class=\"img_ev3q\"></p><p>After clicking on the “Functions” button in the ellipsis icon of the widget data you are interested in, this is what a user sees:</p><p align=\"center\"><img loading=\"lazy\" width=\"600\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/c6c6c5de-fdb9-4a02-9530-f9a1d039527f\" class=\"img_ev3q\"></p><h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"templates\">Templates<a href=\"#templates\" class=\"hash-link\" aria-label=\"Direct link to Templates\" title=\"Direct link to Templates\">​</a></h2><p>Since <a href=\"https://my.openbb.co/app/pro\" target=\"_blank\" rel=\"noopener noreferrer\">OpenBB Terminal Pro</a> users are used to the templates they have access to with our product, e.g. our equity analyst template:</p><p align=\"center\"><img loading=\"lazy\" width=\"600\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/09c074fd-e6e1-4c53-90bc-14451b585d1a\" class=\"img_ev3q\"></p><p>We ensured that similar templates were available for the Excel Add-in, and you can find them <a href=\"https://my.openbb.co/app/excel/templates\" target=\"_blank\" rel=\"noopener noreferrer\">here</a>.</p><p align=\"center\"><img loading=\"lazy\" width=\"600\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/7b3be142-ee3e-4023-b4a3-c04443225f12\" class=\"img_ev3q\"></p><h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"whats-next\">What's Next<a href=\"#whats-next\" class=\"hash-link\" aria-label=\"Direct link to What's Next\" title=\"Direct link to What's Next\">​</a></h2><p>Last but not least, we are working on the upcoming integration of the \"Bring Your Own Data\" (BYOD) feature into our Excel Add-in.</p><p>Until now, this capability has been exclusive to the OpenBB Terminal Pro and is a <strong>cornerstone of our offering</strong>.</p><p>But it doesn’t have to stop there.</p><p>Our foundation on an open-source platform empowers us to facilitate open data access across multiple interfaces, whether through the Terminal Pro or the Excel Add-in.</p><p>We expect this to be a complete game-changer in the industry. While numerous financial Excel add-ins exist, they lack the flexibility to seamlessly incorporate third-party or proprietary datasets.</p><p>We are currently working with design partners on this. So if this sounds like something you are interested in - please reach out.</p><p>We have a 5,000+ <a href=\"https://my.openbb.co/app/pro/early-access\" target=\"_blank\" rel=\"noopener noreferrer\">waitlist</a> to the Terminal Pro and have already started onboarding users. As part of the Terminal Pro free trial, you will be granted access to the OpenBB Add-in for Excel as long as you have Microsoft Excel.</p><p>Wondering how to get started easily? Here is a video to help:</p><div class=\"flex place-items-center justify-center items-center rounded-sm mx-auto\"><iframe src=\"https://www.youtube.com/embed/Rn3M36H_6Cw?si=hxCf3zMw2y4kIi7N\" width=\"800\" height=\"400\"></iframe></div><br><p>You can find more tutorials in the <a href=\"https://docs.openbb.co/excel/getting-started/installation\" target=\"_blank\" rel=\"noopener noreferrer\">Documentation</a>.</p><p>For more information, contact us at <a href=\"mailto:sales@openbb.finance\" target=\"_blank\" rel=\"noopener noreferrer\">sales@openbb.finance</a> or sign up for <a href=\"https://my.openbb.co/app/pro/early-access\" target=\"_blank\" rel=\"noopener noreferrer\">our waitlist</a>.</p>",
            "url": "https://didierlopes.com/blog/introducing-the-openbb-add-in-for-excel",
            "title": "Introducing the OpenBB Add-in for Excel",
            "summary": "We acknowledged the enduring centrality of Excel in the financial sector, so we're now making data from the Terminal Pro readily available in Excel. We're also excitedly working to integrate the \"Bring Your Own Data\" feature into our Excel Add-in, a move we foresee as a transformative step in the financial data industry.",
            "date_modified": "2024-01-17T00:00:00.000Z",
            "tags": [
                "excel",
                "launch",
                "openbb",
                "announcement"
            ]
        },
        {
            "id": "https://didierlopes.com/blog/slack-gpt-summarizing-messages",
            "content_html": "<p align=\"center\"><img loading=\"lazy\" width=\"600\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/d87dc0c7-96b6-42b8-8c7a-8bcd6240510a\" class=\"img_ev3q\"></p><br><p>The SlackGPT is a Slack bot that summarizes conversations and sends you a summary per channel.</p><p>The open source code is available <a href=\"https://github.com/DidierRLopes/slackGPT\" target=\"_blank\" rel=\"noopener noreferrer\">here</a>.</p><div style=\"border-top:1px solid #0088CC;margin:1.5em 0\"></div><h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"context\">Context<a href=\"#context\" class=\"hash-link\" aria-label=\"Direct link to Context\" title=\"Direct link to Context\">​</a></h2><p>Saw someone the other day tweeting that it would be great if there was a SlackGPT that could summarize all the Slack messages for when they wake up.</p><p>And I immediately related to that. We are a team of 20, and I'm the only one in SF. So when I wake up, most of the team is already half a day in or has just wrapped up.</p><p>That means that I always spend the first 30 minutes of the day reading messages to catch-up on everything.</p><p>And tonight felt like hacking something quick.</p><p>So I created a script that:</p><ul><li>Reads all Slack messages from the time I go to bed</li><li>Summarizes the conversation of each channel</li><li>The bot sends me a message with this summary</li></ul><h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"getting-started\">Getting Started<a href=\"#getting-started\" class=\"hash-link\" aria-label=\"Direct link to Getting Started\" title=\"Direct link to Getting Started\">​</a></h2><p>Clone the open source project <a href=\"https://github.com/DidierRLopes/slackGPT\" target=\"_blank\" rel=\"noopener noreferrer\">here</a>.</p><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"slack-api\">Slack API<a href=\"#slack-api\" class=\"hash-link\" aria-label=\"Direct link to Slack API\" title=\"Direct link to Slack API\">​</a></h3><ol><li><p>Go to <a href=\"https://api.slack.com/apps\" target=\"_blank\" rel=\"noopener noreferrer\">Slack API page</a> and create a new app.</p></li><li><p>Install the app in the workspace you are interested in summarizing Slack messages.</p></li><li><p>Get the User OAuth Token which exists in the Install App settings. This will be needed to use Slack's SDK. Set this value as the <code>SLACK_TOKEN</code> on a <code>.env</code> file if you want to run the script locally or as a GitHub secret if you want to leverage the GitHub workflow.</p></li></ol><br><p align=\"center\"><img loading=\"lazy\" width=\"600\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/8aae6649-7d43-41b6-95ed-80ae39996ab2\" class=\"img_ev3q\"></p><ol start=\"4\"><li><p>Create a <strong>Webhook URL</strong> for your channel so that you can receive messages' summary. Set this value as the <code>SLACK_WEBHOOK_URL`` on a </code>.env` file if you want to run the script locally or as a GitHub secret if you want to leverage the GitHub workflow.</p></li><li><p>Depending on the type of access needed, different <strong>User Token Scopes</strong> need to be set. Here's the methods that we will need and the associated user token scopes.</p><ul><li><p>conversations_history: This method retrieves a conversation's history of messages and events. It requires the <strong>channels:history</strong> scope for public channels, or <strong>groups:history</strong> for private channels and im:history for direct messages.</p></li><li><p>users_info: This method returns information about a user. It requires the <strong>users:read</strong> scope.</p></li><li><p>conversations_info: This method retrieves information about a conversation. It requires the <strong>channels:read</strong> scope for public channels, or <strong>groups:read</strong> for private channels and im:read for direct messages.</p></li></ul></li></ol><br><p align=\"center\"><img loading=\"lazy\" width=\"600\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/a710c526-e6ca-4fdc-954d-f720f0dbb973\" class=\"img_ev3q\"></p><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"openai-api\">OpenAI API<a href=\"#openai-api\" class=\"hash-link\" aria-label=\"Direct link to OpenAI API\" title=\"Direct link to OpenAI API\">​</a></h3><p>Go to <a href=\"https://platform.openai.com/api-keys\" target=\"_blank\" rel=\"noopener noreferrer\">OpenAI API page</a> to extract the API key. Set this value as the <code>OPENAI_API_KEY</code> on a <code>.env</code> file if you want to run the script locally or as a GitHub secret if you want to leverage the GitHub workflow.</p><br><p align=\"center\"><img loading=\"lazy\" width=\"600\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/92bd4c45-c34b-42f6-a5e9-b76971ee9881\" class=\"img_ev3q\"></p><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"slack-channels\">Slack channels<a href=\"#slack-channels\" class=\"hash-link\" aria-label=\"Direct link to Slack channels\" title=\"Direct link to Slack channels\">​</a></h3><p>Get the Channel IDs that you are interested in reading messages from.</p><p>Set those values as the <code>SLACK_CHANNEL_IDS</code> on a <code>.env</code> file if you want to run the script locally or as a GitHub secret if you want to leverage the GitHub workflow. If you want to read from multiple channels you can set <code>SLACK_CHANNEL_IDS</code> with multiple IDs separated by commas (with no space), e.g. ABC123,DEF456,GHI789.</p><br><p align=\"center\"><img loading=\"lazy\" width=\"600\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/1c24436f-940d-473e-8549-88d3d1b53fd4\" class=\"img_ev3q\"></p><h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"running\">Running<a href=\"#running\" class=\"hash-link\" aria-label=\"Direct link to Running\" title=\"Direct link to Running\">​</a></h3><p>After you fork the project <a href=\"https://github.com/DidierRLopes/slackGPT\" target=\"_blank\" rel=\"noopener noreferrer\">here</a>, there are 2 ways you can run the code.</p><ol><li><p>Ad-hoc by running the python script with <code>python slackgpt.py</code></p></li><li><p>Automatically, by leveraging GitHub actions. For this you will need to set up GitHub secrets and you can modify <a href=\"https://github.com/DidierRLopes/slackGPT/blob/main/.github/workflows/main.yml\" target=\"_blank\" rel=\"noopener noreferrer\">this workflow</a> in order to change the frequency of the messages sumary. </p></li></ol><p>The most important part of this script is the <code>cron: '0 8 * * 1-5'</code> which specifies the frequency. In this case, the expression means that the task will run at 8:00 AM from Monday to Friday, and breaks down as follows:</p><ul><li><p>0: Specifies the minute when the task will run (in this case, 0 minutes).</p></li><li><p>8: Specifies the hour when the task will run (in this case, 8 AM).</p></li><li><p>*: Represents any day of the month, meaning the task is not restricted to a specific day.</p></li><li><p>*: Represents any month, meaning the task is not restricted to a specific month.</p></li><li><p>1-5: Specifies the days of the week when the task will run (Monday to Friday).</p></li></ul><h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"results\">Results<a href=\"#results\" class=\"hash-link\" aria-label=\"Direct link to Results\" title=\"Direct link to Results\">​</a></h2><p>By inputting the following text on the Slack channel of my choice:</p><p align=\"center\"><img loading=\"lazy\" width=\"600\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/0622eca6-76c5-46f9-86bd-e357fa8b934b\" class=\"img_ev3q\"></p><p>The SlackGPT summarized it as follows:</p><p align=\"center\"><img loading=\"lazy\" width=\"600\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/4a20acf4-7ed6-4f18-96b8-a63f1072e6b1\" class=\"img_ev3q\"></p>",
            "url": "https://didierlopes.com/blog/slack-gpt-summarizing-messages",
            "title": "SlackGPT - Your Slack bot that summarizes unread messages",
            "summary": "The SlackGPT is a Slack bot that summarizes conversations and sends you a summary per channel.",
            "date_modified": "2024-01-15T00:00:00.000Z",
            "tags": [
                "slack",
                "slackgpt",
                "llm",
                "summarization",
                "open source",
                "bot"
            ]
        },
        {
            "id": "https://didierlopes.com/blog/building-my-personal-website-in-docusaurus",
            "content_html": "<p align=\"center\"><img loading=\"lazy\" width=\"600\" src=\"https://github.com/DidierRLopes/my-website/assets/25267873/0ae365f8-af88-4d1d-a8f2-bcbe70904749\" class=\"img_ev3q\"></p><br><p>How I'm using Docusaurus to build my own personal website.</p><div style=\"border-top:1px solid #0088CC;margin:1.5em 0\"></div><p>One of my goals for 2023 was to learn web development. Given that I knew 0 to nothing last year, I am extremely happy with my progress.</p><p>I never had the time to fully dedicate to it in terms of doing a program/course — but as with anything in life, the best way to learn is by doing.</p><p>And this year I worked on web development for:</p><ul><li>OpenBB Hub — <a href=\"https://my.openbb.co\" target=\"_blank\" rel=\"noopener noreferrer\">https://my.openbb.co</a></li><li>OpenBB marketing website — <a href=\"https://openbb.co\" target=\"_blank\" rel=\"noopener noreferrer\">https://openbb.co</a></li><li>OpenBB docs — <a href=\"https://docs.openbb.co\" target=\"_blank\" rel=\"noopener noreferrer\">https://docs.openbb.co</a></li><li>OpenBB Terminal Pro — <a href=\"https://pro.openbb.co\" target=\"_blank\" rel=\"noopener noreferrer\">https://pro.openbb.co</a></li></ul><p>Thank you José Donato for always helping me with anything!</p><p>In addition, I’ve always wanted to have my own personal website. So I felt that this would be the perfect opportunity to do so as I could spend some time with it over weekends.</p><p>And so I did, and open source here: <a href=\"https://github.com/DidierRLopes/personal-website\" target=\"_blank\" rel=\"noopener noreferrer\">https://github.com/DidierRLopes/personal-website</a></p><p>However, this website was taking too much of my spare time, which I could use for more important work. And at the time I became very familiar with Docusaurus, which is what we use for OpenBB docs.</p><p>So I thought — why not just use Docusaurus to make my personal website? It’s easy to edit, I’m already very familiar with the architecture, and it’s very easy to update when there’s new information.</p><p>So that’s what I did, and also made the entire code open source here: <a href=\"https://github.com/DidierRLopes/my-website\" target=\"_blank\" rel=\"noopener noreferrer\">https://github.com/DidierRLopes/my-website</a></p><p>You can access the full website here — <a href=\"https://didierlopes.com/\" target=\"_blank\" rel=\"noopener noreferrer\">https://didierlopes.com/</a>, and there you can find: my personal projects, books I’ve read or want to read, interviews/webinars/podcasts, resume or even my blog.</p><p>Any feedback is welcome.</p>",
            "url": "https://didierlopes.com/blog/building-my-personal-website-in-docusaurus",
            "title": "Building my personal website in Docusaurus",
            "summary": "How I'm using Docusaurus to build my own personal website.",
            "date_modified": "2024-01-08T00:00:00.000Z",
            "tags": [
                "docusaurus",
                "website",
                "blog"
            ]
        }
    ]
}